{
  "onde": [
    {
      "text": "Today at the publishing house: reading a nursery rhyme out loud for the fifth time.\n\nNot because there are mistakes. But because rhythm matters.\n\nWhen a child reads aloud, every syllable counts. Every pause. Every breath.\n\nA good children's poem isn't just read — it's felt. It becomes a song in the mouth.\n\nThat's what we're looking for. That moment when words become music.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_5bv9rkqfn",
      "status": "queued"
    },
    {
      "text": "A children's book is not a simple book.\n\nIt's a book that has to say complex things with simple words.\n\nIt takes more work, not less. More thought, not less. More craft, not less.\n\nThe hardest writing looks the easiest.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_jfje01x1q",
      "status": "queued"
    },
    {
      "text": "Epictetus was born a slave. He couldn't read. He had nothing.\n\nAnd yet he became one of the greatest philosophers in history.\n\n\"It's not what happens to you, but how you react to it that matters.\"\n\nSome people are born with advantages. Others build themselves from nothing.\n\nThe second kind often understands life better.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Epictetus",
        "source": "Enchiridion"
      },
      "id": "content_1768836849986_22lhd6q1q",
      "status": "queued"
    },
    {
      "text": "This morning I spent two hours choosing a font for a children's poetry book.\n\nIt might seem like a small thing. But fonts speak before words do.\n\nA rounded font says \"this is playful.\" A serif font says \"this is serious.\"\n\nFor a children's book, you need something in between — something that says \"this matters, but it's also fun.\"\n\nThe invisible choices are often the most important ones.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_z1t6q0pwg",
      "status": "queued"
    },
    {
      "text": "Reading to a child before bed isn't just a habit.\n\nIt's a ritual. And rituals build people.\n\nThe stories we hear as children become the foundation of who we become.\n\nChoose them carefully.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_sx6ayl1kb",
      "status": "queued"
    },
    {
      "text": "Every morning, before dawn, Marcus Aurelius would remind himself:\n\n\"When you arise in the morning, think of what a precious privilege it is to be alive — to breathe, to think, to enjoy, to love.\"\n\nHe was preparing himself for difficult days. War. Politics. Betrayal.\n\nMaybe that's when gratitude matters most — not when things are easy, but when they're hard.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Marcus Aurelius",
        "source": "Meditations"
      },
      "id": "content_1768836849986_i0dui49as",
      "status": "queued"
    },
    {
      "text": "7 AM. First draft of a new book.\n\nThe beginning of any book is the hardest part. Not because it's difficult to write — but because it makes a promise.\n\nEvery first sentence says: \"Here's what this book will give you.\"\n\nAnd then you have to deliver on that promise for every page that follows.\n\nNo pressure.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_dzvokl6dc",
      "status": "queued"
    },
    {
      "text": "What's the difference between a book and a good book?\n\nA good book makes you think even after you close it.\n\nThe story ends. The questions don't.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_0lks4d3c3",
      "status": "queued"
    },
    {
      "text": "We spent all day on one translation today.\n\nThe challenge: some Italian words have no English equivalent. Some feelings exist in one language but not another.\n\nThe solution isn't to find the perfect word. It's to find the perfect feeling.\n\nYou can't always translate words. But you can always translate meaning.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_4q8hoyxvt",
      "status": "queued"
    },
    {
      "text": "Children's books are also for adults.\n\nSometimes, especially for adults.\n\nChildren already know many of the things we've forgotten. The books remind us.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_ssl0sb2d1",
      "status": "queued"
    },
    {
      "text": "In a letter to his friend Lucilius, Seneca wrote something that still stops me:\n\n\"Life is long, if you know how to use it.\"\n\nNine words. Two thousand years old.\n\nMost people complain about not having enough time. Seneca suggests maybe we just don't know how to spend the time we have.\n\nWhat would change if we really believed this?",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Seneca",
        "source": "Letters to Lucilius"
      },
      "id": "content_1768836849986_48xfxi6wk",
      "status": "queued"
    },
    {
      "text": "We tested our illustrations with actual children today.\n\nThey noticed things we didn't see. They missed things we thought were obvious.\n\nThere's no substitute for the real audience. The people you're creating for will always surprise you.\n\nBest feedback session we've ever had.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_rc8n3rkpu",
      "status": "queued"
    },
    {
      "text": "Every illustration tells a story that words don't say.\n\nThere's a silent conversation between text and image. When it works, the reader doesn't even notice.\n\nThat's the goal — to create something so natural it becomes invisible.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_s0f3uuqui",
      "status": "queued"
    },
    {
      "text": "Around 170 AD, a Roman emperor sat alone in his tent after a long day of battle. By candlelight, he wrote in his private journal:\n\n\"The happiness of your life depends upon the quality of your thoughts.\"\n\nMarcus Aurelius never intended for anyone to read these words. They were reminders to himself, on the hardest days.\n\nTwo thousand years later, they still find the people who need them.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Marcus Aurelius",
        "year": "170 AD",
        "source": "Meditations"
      },
      "id": "content_1768836849986_tc7ugych9",
      "status": "queued"
    },
    {
      "text": "We're working on a book that explains AI to children.\n\nThe challenge: how do you talk about technology without losing the magic?\n\nA robot can be a friend. Science can be poetry. The future can be exciting instead of scary.\n\nThe best explanations don't just inform — they inspire wonder.\n\nThat's what we're trying to create.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_skt6ewg6g",
      "status": "queued"
    },
    {
      "text": "Publishing a book is like sending a message in a bottle.\n\nYou don't know who will find it. You don't know when.\n\nBut you hope it reaches someone who needed exactly those words, at exactly that moment.\n\nSometimes it does. And that makes everything worth it.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_mmk1enj25",
      "status": "queued"
    },
    {
      "text": "Epictetus taught that we should focus only on what we can control.\n\n\"Some things are within our power, while others are not.\"\n\nSimple idea. Revolutionary practice.\n\nYou can't control the weather. You can control how you dress.\nYou can't control others' opinions. You can control your actions.\nYou can't control the past. You can control what you do next.\n\nFreedom begins with this distinction.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Epictetus",
        "source": "Enchiridion"
      },
      "id": "content_1768836849986_vttgdrniy",
      "status": "queued"
    },
    {
      "text": "Marcus Aurelius ruled the most powerful empire in history. He could have anything he wanted.\n\nWhat he wanted was to be a better person.\n\n\"Waste no more time arguing about what a good man should be. Be one.\"\n\nHe wrote this for himself, not for us. But sometimes the most private words become the most universal.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Marcus Aurelius",
        "source": "Meditations"
      },
      "id": "content_1768836849986_w11jymv0h",
      "status": "queued"
    },
    {
      "text": "Here's something Seneca noticed two thousand years ago:\n\n\"We suffer more often in imagination than in reality.\"\n\nHow much of your worry is about things that never happen? How many sleepless nights for problems that solve themselves?\n\nThe Stoics didn't have anxiety medication. They had philosophy. And sometimes, that's enough.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Seneca",
        "source": "Letters to Lucilius"
      },
      "id": "content_1768836849986_qjr4st5ax",
      "status": "queued"
    },
    {
      "text": "Seneca once wrote:\n\n\"Luck is what happens when preparation meets opportunity.\"\n\nWe call it luck when someone succeeds. But watch closely — behind every \"overnight success\" there are years of invisible work.\n\nThe lucky ones aren't lucky. They were just ready when the moment came.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Seneca"
      },
      "id": "content_1768836849986_etk4k70j7",
      "status": "queued"
    },
    {
      "text": "Today: choosing a book cover.\n\nWe rejected twelve versions. The thirteenth felt close. We remade it anyway.\n\nThe fourteenth was the one.\n\nA cover has three seconds to tell a story. Three seconds to make a promise.\n\nThat's why it takes so long to get right.",
      "account": "onde",
      "type": "dietro_le_quinte",
      "id": "content_1768836849986_56iz1gi22",
      "status": "queued"
    },
    {
      "text": "Seneca was one of the richest men in Rome. He had everything.\n\nAnd yet he wrote:\n\n\"It is not that we have a short time to live, but that we waste a lot of it.\"\n\nWealth didn't blind him to the truth. Time is the only thing we can never get back.\n\nTwo thousand years later, we're still learning this lesson.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Seneca",
        "source": "On the Shortness of Life"
      },
      "id": "content_1768836849986_byxzqqixa",
      "status": "queued"
    },
    {
      "text": "Marcus Aurelius, to himself:\n\n\"The impediment to action advances action. What stands in the way becomes the way.\"\n\nThree words that have traveled through millennia: The obstacle is the way.\n\nEvery problem contains its own solution. Every difficulty teaches something essential.\n\nThe Stoics understood this. We're still learning.",
      "account": "onde",
      "type": "citazione",
      "metadata": {
        "author": "Marcus Aurelius",
        "source": "Meditations"
      },
      "id": "content_1768836849986_sxxacvnnm",
      "status": "queued"
    },
    {
      "text": "Children's poetry is the hardest form.\n\nIt has to be simple without being shallow.\nMusical without being artificial.\nDeep without being heavy.\n\nAnyone can write complicated poetry for adults.\n\nBut writing something a child will remember forever? That's art.",
      "account": "onde",
      "type": "riflessione",
      "id": "content_1768836849986_v0c7frikc",
      "status": "queued"
    }
  ],
  "frh": [
    {
      "text": "Milestone: 50 paper trades without a critical error.\n\nIt's not glamorous. It's not exciting. No one throws a party for \"didn't break for a while.\"\n\nBut that's what progress looks like most of the time. Small wins. Quiet improvements. One step at a time.",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_ls403dst3",
      "status": "queued"
    },
    {
      "text": "The auto-posting system finally works.\n\nEvery day at 21:30, the bot scans what we built, picks the most interesting thing, and tells the world.\n\nWhile I sleep, it works.\n\nWe live in strange times. And I kind of love it.",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_qleusbdx3",
      "status": "queued"
    },
    {
      "text": "Lesson learned today: never trust mock data.\n\nThe bot worked perfectly with fake data. Beautiful. Flawless.\n\nIn production? It discovered that real-world data is weird. Messy. Unpredictable.\n\nThe simulation is never the real thing. The map is never the territory.\n\nAlways test with reality.",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_uu53q17wm",
      "status": "queued"
    },
    {
      "text": "Spent 4 hours debugging an error.\n\nThe problem: a typo. One letter. That's it.\n\nThe lesson: complex problems often have simple solutions.\n\nAlso: maybe I just needed coffee. Hard to say.",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_52o39islk",
      "status": "queued"
    },
    {
      "text": "I built a bot that writes commit messages.\n\nThen I built a bot that reads those commit messages and posts about them on Twitter.\n\nBots talking about bots. Meta-automation.\n\nWe live in interesting times.",
      "account": "frh",
      "type": "tool",
      "id": "content_1768836849986_dpp6z8zqp",
      "status": "queued"
    },
    {
      "text": "This week's lesson: automate first, optimize later.\n\nAn imperfect system that runs is better than a perfect system on paper.\n\nShip it. Learn from it. Improve it.\n\nPerfection is the enemy of progress.",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_9o9b26c88",
      "status": "queued"
    },
    {
      "text": "Something nobody tells you about software development:\n\n90% of the time is spent figuring out why something doesn't work.\n10% of the time is spent actually writing code.\n\nToday was a 95% day.\n\nAnd that's okay. That's the job.",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_vbvz297df",
      "status": "queued"
    },
    {
      "text": "Today's stack: TypeScript, Claude API, Telegram Bot.\n\nNot the newest. Not the trendiest.\n\nBut you know what? It works. It's reliable. It does the job.\n\nSometimes the best thing you can say about a technology is: it gets out of the way.",
      "account": "frh",
      "type": "tool",
      "id": "content_1768836849986_sztqger76",
      "status": "queued"
    },
    {
      "text": "The trading bot lost $45 in paper trading last week.\n\nToday I added a system that analyzes its own mistakes and adjusts automatically.\n\nIt's basically teaching itself. Learning from failure. Getting better with each error.\n\nLet's see if it learns from its mistakes better than I do.\n\n(The answer is probably yes.)",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_skr44nsj9",
      "status": "queued"
    },
    {
      "text": "Tool discovery: paper trading for testing strategies.\n\nFake money. Real lessons.\n\nIt's the best way to learn without paying full price for your mistakes.\n\nEvery trader should start here. Every developer too, in their own way.",
      "account": "frh",
      "type": "tool",
      "id": "content_1768836849986_gp28ha194",
      "status": "queued"
    },
    {
      "text": "This morning: fixing a bug in the notification system.\n\nThe problem? It worked too well.\n\n50 notifications in 10 minutes. Technically correct. Practically unbearable.\n\nSometimes the bug isn't that something doesn't work. It's that it works exactly as you designed it — and your design was wrong.",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_yg6l9nlqh",
      "status": "queued"
    },
    {
      "text": "Interesting bug: the system only worked on Tuesdays.\n\nThe reason: a test I wrote 6 months ago, incorrectly.\n\nThe code has a long memory. Every shortcut comes back eventually.\n\nWrite tests like someone else will read them. (Because future you is someone else.)",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_gnay7l0le",
      "status": "queued"
    },
    {
      "text": "Today I deleted more code than I wrote.\n\nAnd it felt great.\n\nSometimes the best solution is subtraction, not addition. Removing complexity instead of adding it.\n\nSimplicity is hard. But it's worth it.",
      "account": "frh",
      "type": "lesson",
      "id": "content_1768836849986_wqah0vdws",
      "status": "queued"
    },
    {
      "text": "Automation of the week: automatic posting at 21:30.\n\nThe bot scans the day's commits, picks the most interesting one, writes a post about it.\n\nI sleep. It works.\n\nThe future is strange. Machines talking about what machines built.\n\nAnd somehow, it's kind of beautiful.",
      "account": "frh",
      "type": "tool",
      "id": "content_1768836849986_lw33klez4",
      "status": "queued"
    },
    {
      "text": "Today: refactoring code I wrote yesterday.\n\nWhen you write code at 2 AM, it always seems brilliant.\n\nIn the light of day? Less so.\n\nThe best programmers aren't the ones who never write bad code. They're the ones willing to admit it and fix it.",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_16g0c7ge8",
      "status": "queued"
    },
    {
      "text": "Three days to make one feature work.\n\nIt seemed simple when I started. \"Should take an hour,\" I thought.\n\nNarrator: It did not take an hour.\n\nThe lesson: simple in theory is often complex in practice.\n\nThe code doesn't care about your estimates.",
      "account": "frh",
      "type": "progress",
      "id": "content_1768836849986_v6agqu2tn",
      "status": "queued"
    },
    {
      "text": "Today: connecting 3 different APIs into one flow.\n\nEvery API has its own rules. Its own quirks. Its own way of failing.\n\nIntegration is like being a translator between languages that don't quite match.\n\nWhen it works, it feels like magic. When it doesn't... well, there's always tomorrow.",
      "account": "frh",
      "type": "tool",
      "id": "content_1768836849986_ttmgy55oy",
      "status": "queued"
    }
  ],
  "lastPosted": {
    "onde": null,
    "frh": null
  }
}