{
  "ciclo_1": {
    "riletttore": [
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "# La Repubblica dell'Innovazione\n\n*Traduzione italiana*\n\n---\n\n## Introduzione alla concezione repubblicana della libertà\n\nNaturalmente, un'interferenza che frustra la mia preferenza è più dolorosa di una che non lo fa: ma ciò che lede la mia libertà è l'interferenza, non la frustrazione.\n\nEppure questa concezione è vulnerabile a un'obiezione parallela. Supponiamo che tu abbia il potere di interferire nella mia scelta su come trascorrere le mie serate; io lo so, e ti chiedo di non usare quel potere questa sera; tu accetti, e io vado al cinema. Sarebbe altrettanto assurdo descrivere la mia scelta come libera, perché era una conseguenza della temporanea rinuncia al tuo potere. Se la libertà fosse non-interferenza, tuttavia, e l'interferenza fosse vista come un mero fatto, come la visione liberale implica, allora la tua rinuncia renderebbe davvero libera la mia scelta, contraddicendo egualmente le nostre intuizioni. Lo stesso vale per esempi più forti, in cui ti prego, offro incentivi, o mi ingrazio preventivamente con te, così da distogliere la tua mente dall'interferire nelle mie serate. Si può evitare l'assurdità solo se ci si allontana dal vedere l'interferenza come un mero fatto e la si vede invece come una manifestazione di un *potere* di interferenza, che si rivela poi essere la vera lesione alla libertà. Ma compiere questo passo significa abbandonare la concezione liberale e assurgere a quella repubblicana.\n\nL'esempio mostra anche che se si è soggetti alla volontà di qualcun altro, qualsiasi azione si intraprenda è il risultato non di una, ma di due volontà: la propria, e quella del detentore del potere di interferenza, che ha autorizzato la sua azione. L'autorizzazione può essere esplicita, come nel mio esempio, o silenziosa, come nel caso dello schiavo il cui padrone è benevolo: ma ogni volta che quel potere può essere esercitato nessuna azione viene intrapresa senza qualche forma di permesso. Come gli schiavi dell'antichità, conclude Skinner, coloro che sono ",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "soggetti a un potere incontrollato di interferenza sono «incapaci di agire secondo la propria volontà indipendente in qualsiasi momento».\n\nLa concezione repubblicana non è esposta a obiezioni simili, poiché una persona soggetta a tale potere non ha altra opzione che l'acquiescenza o la ribellione. La prima strategia può essere individuale, come nel mio ultimo esempio, ed è compatibile con l'ingraziarsi il detentore di quel potere, poiché comporta l'accettazione di esso. La seconda strategia non può tipicamente essere individuale, ma richiede o un'azione collettiva o un'azione pubblica per estirpare quel potere: cioè, o un'azione collettiva per cambiare le leggi, se queste permettono il dominio, o un'azione pubblica per farle applicare, se lo proibiscono. Da qui l'approccio strumentale della teoria repubblicana alla virtù civica e alla partecipazione politica, che vengono presentate ai cittadini non come imperativi deontologici ma come modi per preservare la propria libertà: «il prezzo della libertà... è l'eterna vigilanza».\n\n---\n\n## Libertà e democrazia\n\nQueste ultime considerazioni gettano luce anche sui legami tra libertà e democrazia, a cui sto per rivolgermi. Poiché proprio come il non-dominio richiede strettamente la democrazia, solo una democrazia può garantire la libertà individuale. I relativamente pochi episodi di autogoverno collettivo tra l'antichità e il diciannovesimo secolo presero forme diverse, naturalmente, così come la nozione di *civitas libera*, lo «stato libero»: ma l'idea che si possa essere liberi solo in tale stato è antica quasi quanto l'idea stessa di non-dominio. Pericle la proclamò nel 431 a.C., nell'orazione funebre che Tucidide riscrive, e quattro secoli dopo Livio la teorizzò indirettamente, narrando la nascita e l'ascesa della Repubblica Romana. Ma ancora più rivelatrici sono le parole di un avversario di quell'idea, il vescovo Ottone di Frisinga. Zio e cronista di Federico I Barbarossa, nel 1158 accompagnò e consigliò l'Imperatore in",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": " una fase della sua lunga e infine infruttuosa campagna per sottomettere quelle città dell'Italia settentrionale, che nel secolo precedente erano effettivamente diventate repubbliche autogovernate. I loro cittadini, commenta, «sono così desiderosi di libertà che, evitando l'insolenza del potere, sono governati dalla volontà di consoli [eletti] piuttosto che di sovrani».\n\n### Confronto: democrazia e legge\n\n> Ἔστι δὲ δημοκρατίας μὲν τέλος ἐλευθερία, ὀλιγαρχίας δὲ πλοῦτος...\n> *[Il fine della democrazia è la libertà, dell'oligarchia la ricchezza]*\n> (Aristotele, IV secolo a.C.)\n\nLa libertà è «distinta» dalla democrazia, dice Fukuyama. La maggior parte dei liberali non lo sono, ma la libertà liberale è anche indifferente a essa. Poiché se libertà significa non-interferenza, ne consegue che qualsiasi legge che costringa i cittadini lede la loro libertà. Se così è, tuttavia, ne consegue anche che la questione se quella legge sia stata adottata per deliberazione democratica o per decreto autocratico è irrilevante dalla prospettiva della libertà, poiché tutto ciò che conta è il puro fatto dell'interferenza. Su entrambi i punti non si potrebbero desiderare dichiarazioni più chiare di quelle di Berlin.\n\nSul primo, egli cita approvandolo Jeremy Bentham — sul cui ruolo tornerò — che dice che «ogni legge è una violazione della libertà». «Molta dell'ostilità neoliberale verso il governo è semplicemente irrazionale», ho citato prima Fukuyama dire: irrazionale, senza dubbio, ma pienamente coerente con la concezione liberale della libertà.\n\nSul secondo punto, Berlin afferma che la libertà «non è incompatibile con alcune forme di autocrazia, o almeno con l'assenza di autogoverno [perché] si occupa principalmente dell'area di controllo, non della sua fonte». (L'espressione «area di controllo» va letta, nelle parole della sua definizione che ho citato prima, come l'estensione in cui le leggi interferiscono all'interno dell'«area in cui [uno] potrebbe altrimenti agire».) Infatti, contin",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "ua Berlin,\n\n> Proprio come una democrazia può, di fatto, privare il singolo cittadino di moltissime libertà che potrebbe avere in qualche altra forma di società, così è perfettamente concepibile che un despota di mentalità liberale permetterebbe ai suoi sudditi un'ampia misura di libertà personale.\n\nBerlin era un democratico, e aggiunge che la democrazia generalmente protegge la libertà meglio dell'autocrazia. Ma insiste che\n\n> non c'è alcuna connessione necessaria tra libertà individuale e governo democratico. La risposta alla domanda «Chi mi governa?» è logicamente distinta dalla domanda «Fino a che punto il governo interferisce con me?»\n\n«È in questa differenza», conclude, «che consiste, alla fine, il grande contrasto tra i due concetti di libertà negativa e positiva». La chiarezza di questa conclusione è offuscata dalla sua definizione evolutiva di libertà positiva, che può riferirsi o all'autopadronanza o all'autorealizzazione. Ma questa questione non deve trattenerci. Ciò che va ritenuto è la sua avvincente dimostrazione che la non-interferenza è un valore separato dalla democrazia, compatibile con l'autocrazia, e quindi indifferente alla natura del regime politico.\n\nTale è la diffusione dell'espressione *democrazia liberale*, riflessivamente assunta per denotare una diade indivisibile, che il ragionamento di Berlin può suonare provocatorio. Anche perché voci influenti hanno spesso avanzato l'argomento opposto, seppure in termini un po' modificati. I libri più popolari di Hayek e Friedman, in particolare, scritti rispettivamente due e quattro anni dopo la conferenza di Berlin, affermano che le libertà economiche e politiche sono inseparabili, sia concettualmente che praticamente, e Wolf descrive similmente democrazia e mercato come «gemelli simbiotici». Queste idee contraddicono direttamente la visione di Berlin, poiché il suo «despota di mentalità liberale» può certamente elargire ampie libertà economiche ai suoi sudditi ma deve necessariamente restringere qu",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "elle politiche. La contraddizione può non essere stata intenzionale, perché Hayek e Friedman scrivevano in difesa delle libertà economiche, che credevano fossero state eccessivamente vincolate negli anni Sessanta, e Wolf non stava discutendo cosa significhi libertà liberale — precisamente perché lui, Fukuyama, e molti altri sembrano aver interiorizzato la definizione di Berlin al punto da prenderla come l'unica o naturale. Il ragionamento di Berlin è invece avvincente, perché nel 1958 stava (di recente) costruendo quella definizione, e stava riflettendo attentamente sulle sue implicazioni.\n\nIl suo argomento formale è anche un necessario contrappunto all'affermazione empirica di Fukuyama che, dopo che la storia ha sposato democrazia e liberalismo, gli autoritari tipicamente attaccano prima il secondo e poi si rivolgono contro la prima. Questo può spesso essere stato vero. Ma quando Hayek e Friedman sostennero il colpo di stato del 1973 in Cile, o l'autocrazia che ne seguì, provarono invece il punto di Berlin, perché affermavano di agire in difesa della libertà. Da qui la mia precedente similitudine dei due motori e dei due cavalli, e la mia osservazione che un'ideologia che separa libertà e democrazia indebolisce entrambe, mettendole in pericolo.\n\n---\n\n## Due esempi contemporanei\n\nPer concludere questa discussione e introdurre l'ultimo elemento del mio confronto, cito due esempi del tipo di posizioni che, al di fuori dell'accademia, sono state agganciate alla visione liberale della libertà. Uno è tratto da un articolo pubblicato nella primavera del 2009, come intervento nell'acceso dibattito che allora infuriava negli Stati Uniti sulla riforma del settore finanziario — che alla fine diede risultati deludenti, come ho detto. L'autore è un imprenditore libertario, Peter Thiel, che più tardi sarebbe diventato un sostenitore di Trump, anche se incostante. «Non credo più che libertà e democrazia siano compatibili», scrisse sul giornale online del Cato Institute, rivolgend",
        "completezza": "unknown"
      }
    ],
    "revisore": [
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "# La Repubblica dell'Innovazione\n\n*Traduzione italiana*\n\n---\n\n## Introduzione alla concezione repubblicana della libertà\n\nNaturalmente, un'interferenza che frustra la mia preferenza è più dolorosa di una che non lo fa: ma ciò che lede la mia libertà è l'interferenza, non la frustrazione.\n\nEppure questa concezione è vulnerabile a un'obiezione parallela. Supponiamo che tu abbia il potere di interferire nella mia scelta su come trascorrere le mie serate; io lo so, e ti chiedo di non usare quel potere questa sera; tu accetti, e io vado al cinema. Sarebbe altrettanto assurdo descrivere la mia scelta come libera, perché era una conseguenza della temporanea rinuncia al tuo potere. Se la libertà fosse non-interferenza, tuttavia, e l'interferenza fosse vista come un mero fatto, come la visione liberale implica, allora la tua rinuncia renderebbe davvero libera la mia scelta, contraddicendo egualmente le nostre intuizioni. Lo stesso vale per esempi più forti, in cui ti prego, offro incentivi, o mi ingrazio preventivamente con te, così da distogliere la tua mente dall'interferire nelle mie serate. Si può evitare l'assurdità solo se ci si allontana dal vedere l'interferenza come un mero fatto e la si vede invece come una manifestazione di un *potere* di interferenza, che si rivela poi essere la vera lesione alla libertà. Ma compiere questo passo significa abbandonare la concezione liberale e assurgere a quella repubblicana.\n\nL'esempio mostra anche che se si è soggetti alla volontà di qualcun altro, qualsiasi azione si intraprenda è il risultato non di una, ma di due volontà: la propria, e quella del detentore del potere di interferenza, che ha autorizzato la sua azione. L'autorizzazione può essere esplicita, come nel mio esempio, o silenziosa, come nel caso dello schiavo il cui padrone è benevolo: ma ogni volta che quel potere può essere esercitato nessuna azione viene intrapresa senza qualche forma di permesso. Come gli schiavi dell'antichità, conclude Skinner, coloro che sono ",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "soggetti a un potere incontrollato di interferenza sono «incapaci di agire secondo la propria volontà indipendente in qualsiasi momento».\n\nLa concezione repubblicana non è esposta a obiezioni simili, poiché una persona soggetta a tale potere non ha altra opzione che l'acquiescenza o la ribellione. La prima strategia può essere individuale, come nel mio ultimo esempio, ed è compatibile con l'ingraziarsi il detentore di quel potere, poiché comporta l'accettazione di esso. La seconda strategia non può tipicamente essere individuale, ma richiede o un'azione collettiva o un'azione pubblica per estirpare quel potere: cioè, o un'azione collettiva per cambiare le leggi, se queste permettono il dominio, o un'azione pubblica per farle applicare, se lo proibiscono. Da qui l'approccio strumentale della teoria repubblicana alla virtù civica e alla partecipazione politica, che vengono presentate ai cittadini non come imperativi deontologici ma come modi per preservare la propria libertà: «il prezzo della libertà... è l'eterna vigilanza».\n\n---\n\n## Libertà e democrazia\n\nQueste ultime considerazioni gettano luce anche sui legami tra libertà e democrazia, a cui sto per rivolgermi. Poiché proprio come il non-dominio richiede strettamente la democrazia, solo una democrazia può garantire la libertà individuale. I relativamente pochi episodi di autogoverno collettivo tra l'antichità e il diciannovesimo secolo presero forme diverse, naturalmente, così come la nozione di *civitas libera*, lo «stato libero»: ma l'idea che si possa essere liberi solo in tale stato è antica quasi quanto l'idea stessa di non-dominio. Pericle la proclamò nel 431 a.C., nell'orazione funebre che Tucidide riscrive, e quattro secoli dopo Livio la teorizzò indirettamente, narrando la nascita e l'ascesa della Repubblica Romana. Ma ancora più rivelatrici sono le parole di un avversario di quell'idea, il vescovo Ottone di Frisinga. Zio e cronista di Federico I Barbarossa, nel 1158 accompagnò e consigliò l'Imperatore in",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": " una fase della sua lunga e infine infruttuosa campagna per sottomettere quelle città dell'Italia settentrionale, che nel secolo precedente erano effettivamente diventate repubbliche autogovernate. I loro cittadini, commenta, «sono così desiderosi di libertà che, evitando l'insolenza del potere, sono governati dalla volontà di consoli [eletti] piuttosto che di sovrani».\n\n### Confronto: democrazia e legge\n\n> Ἔστι δὲ δημοκρατίας μὲν τέλος ἐλευθερία, ὀλιγαρχίας δὲ πλοῦτος...\n> *[Il fine della democrazia è la libertà, dell'oligarchia la ricchezza]*\n> (Aristotele, IV secolo a.C.)\n\nLa libertà è «distinta» dalla democrazia, dice Fukuyama. La maggior parte dei liberali non lo sono, ma la libertà liberale è anche indifferente a essa. Poiché se libertà significa non-interferenza, ne consegue che qualsiasi legge che costringa i cittadini lede la loro libertà. Se così è, tuttavia, ne consegue anche che la questione se quella legge sia stata adottata per deliberazione democratica o per decreto autocratico è irrilevante dalla prospettiva della libertà, poiché tutto ciò che conta è il puro fatto dell'interferenza. Su entrambi i punti non si potrebbero desiderare dichiarazioni più chiare di quelle di Berlin.\n\nSul primo, egli cita approvandolo Jeremy Bentham — sul cui ruolo tornerò — che dice che «ogni legge è una violazione della libertà». «Molta dell'ostilità neoliberale verso il governo è semplicemente irrazionale», ho citato prima Fukuyama dire: irrazionale, senza dubbio, ma pienamente coerente con la concezione liberale della libertà.\n\nSul secondo punto, Berlin afferma che la libertà «non è incompatibile con alcune forme di autocrazia, o almeno con l'assenza di autogoverno [perché] si occupa principalmente dell'area di controllo, non della sua fonte». (L'espressione «area di controllo» va letta, nelle parole della sua definizione che ho citato prima, come l'estensione in cui le leggi interferiscono all'interno dell'«area in cui [uno] potrebbe altrimenti agire».) Infatti, contin",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "ua Berlin,\n\n> Proprio come una democrazia può, di fatto, privare il singolo cittadino di moltissime libertà che potrebbe avere in qualche altra forma di società, così è perfettamente concepibile che un despota di mentalità liberale permetterebbe ai suoi sudditi un'ampia misura di libertà personale.\n\nBerlin era un democratico, e aggiunge che la democrazia generalmente protegge la libertà meglio dell'autocrazia. Ma insiste che\n\n> non c'è alcuna connessione necessaria tra libertà individuale e governo democratico. La risposta alla domanda «Chi mi governa?» è logicamente distinta dalla domanda «Fino a che punto il governo interferisce con me?»\n\n«È in questa differenza», conclude, «che consiste, alla fine, il grande contrasto tra i due concetti di libertà negativa e positiva». La chiarezza di questa conclusione è offuscata dalla sua definizione evolutiva di libertà positiva, che può riferirsi o all'autopadronanza o all'autorealizzazione. Ma questa questione non deve trattenerci. Ciò che va ritenuto è la sua avvincente dimostrazione che la non-interferenza è un valore separato dalla democrazia, compatibile con l'autocrazia, e quindi indifferente alla natura del regime politico.\n\nTale è la diffusione dell'espressione *democrazia liberale*, riflessivamente assunta per denotare una diade indivisibile, che il ragionamento di Berlin può suonare provocatorio. Anche perché voci influenti hanno spesso avanzato l'argomento opposto, seppure in termini un po' modificati. I libri più popolari di Hayek e Friedman, in particolare, scritti rispettivamente due e quattro anni dopo la conferenza di Berlin, affermano che le libertà economiche e politiche sono inseparabili, sia concettualmente che praticamente, e Wolf descrive similmente democrazia e mercato come «gemelli simbiotici». Queste idee contraddicono direttamente la visione di Berlin, poiché il suo «despota di mentalità liberale» può certamente elargire ampie libertà economiche ai suoi sudditi ma deve necessariamente restringere qu",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "elle politiche. La contraddizione può non essere stata intenzionale, perché Hayek e Friedman scrivevano in difesa delle libertà economiche, che credevano fossero state eccessivamente vincolate negli anni Sessanta, e Wolf non stava discutendo cosa significhi libertà liberale — precisamente perché lui, Fukuyama, e molti altri sembrano aver interiorizzato la definizione di Berlin al punto da prenderla come l'unica o naturale. Il ragionamento di Berlin è invece avvincente, perché nel 1958 stava (di recente) costruendo quella definizione, e stava riflettendo attentamente sulle sue implicazioni.\n\nIl suo argomento formale è anche un necessario contrappunto all'affermazione empirica di Fukuyama che, dopo che la storia ha sposato democrazia e liberalismo, gli autoritari tipicamente attaccano prima il secondo e poi si rivolgono contro la prima. Questo può spesso essere stato vero. Ma quando Hayek e Friedman sostennero il colpo di stato del 1973 in Cile, o l'autocrazia che ne seguì, provarono invece il punto di Berlin, perché affermavano di agire in difesa della libertà. Da qui la mia precedente similitudine dei due motori e dei due cavalli, e la mia osservazione che un'ideologia che separa libertà e democrazia indebolisce entrambe, mettendole in pericolo.\n\n---\n\n## Due esempi contemporanei\n\nPer concludere questa discussione e introdurre l'ultimo elemento del mio confronto, cito due esempi del tipo di posizioni che, al di fuori dell'accademia, sono state agganciate alla visione liberale della libertà. Uno è tratto da un articolo pubblicato nella primavera del 2009, come intervento nell'acceso dibattito che allora infuriava negli Stati Uniti sulla riforma del settore finanziario — che alla fine diede risultati deludenti, come ho detto. L'autore è un imprenditore libertario, Peter Thiel, che più tardi sarebbe diventato un sostenitore di Trump, anche se incostante. «Non credo più che libertà e democrazia siano compatibili», scrisse sul giornale online del Cato Institute, rivolgend",
        "qualita_stimata": "unknown"
      }
    ]
  },
  "ciclo_2": {
    "riletttore": [
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "# La Repubblica dell'Innovazione\n\n*Traduzione italiana*\n\n---\n\n## Introduzione alla concezione repubblicana della libertà\n\nNaturalmente, un'interferenza che frustra la mia preferenza è più dolorosa di una che non lo fa: ma ciò che lede la mia libertà è l'interferenza, non la frustrazione.\n\nEppure questa concezione è vulnerabile a un'obiezione parallela. Supponiamo che tu abbia il potere di interferire nella mia scelta su come trascorrere le mie serate; io lo so, e ti chiedo di non usare quel potere questa sera; tu accetti, e io vado al cinema. Sarebbe altrettanto assurdo descrivere la mia scelta come libera, perché era una conseguenza della temporanea rinuncia al tuo potere. Se la libertà fosse non-interferenza, tuttavia, e l'interferenza fosse vista come un mero fatto, come la visione liberale implica, allora la tua rinuncia renderebbe davvero libera la mia scelta, contraddicendo egualmente le nostre intuizioni. Lo stesso vale per esempi più forti, in cui ti prego, offro incentivi, o mi ingrazio preventivamente con te, così da distogliere la tua mente dall'interferire nelle mie serate. Si può evitare l'assurdità solo se ci si allontana dal vedere l'interferenza come un mero fatto e la si vede invece come una manifestazione di un *potere* di interferenza, che si rivela poi essere la vera lesione alla libertà. Ma compiere questo passo significa abbandonare la concezione liberale e assurgere a quella repubblicana.\n\nL'esempio mostra anche che se si è soggetti alla volontà di qualcun altro, qualsiasi azione si intraprenda è il risultato non di una, ma di due volontà: la propria, e quella del detentore del potere di interferenza, che ha autorizzato la sua azione. L'autorizzazione può essere esplicita, come nel mio esempio, o silenziosa, come nel caso dello schiavo il cui padrone è benevolo: ma ogni volta che quel potere può essere esercitato nessuna azione viene intrapresa senza qualche forma di permesso. Come gli schiavi dell'antichità, conclude Skinner, coloro che sono ",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "soggetti a un potere incontrollato di interferenza sono «incapaci di agire secondo la propria volontà indipendente in qualsiasi momento».\n\nLa concezione repubblicana non è esposta a obiezioni simili, poiché una persona soggetta a tale potere non ha altra opzione che l'acquiescenza o la ribellione. La prima strategia può essere individuale, come nel mio ultimo esempio, ed è compatibile con l'ingraziarsi il detentore di quel potere, poiché comporta l'accettazione di esso. La seconda strategia non può tipicamente essere individuale, ma richiede o un'azione collettiva o un'azione pubblica per estirpare quel potere: cioè, o un'azione collettiva per cambiare le leggi, se queste permettono il dominio, o un'azione pubblica per farle applicare, se lo proibiscono. Da qui l'approccio strumentale della teoria repubblicana alla virtù civica e alla partecipazione politica, che vengono presentate ai cittadini non come imperativi deontologici ma come modi per preservare la propria libertà: «il prezzo della libertà... è l'eterna vigilanza».\n\n---\n\n## Libertà e democrazia\n\nQueste ultime considerazioni gettano luce anche sui legami tra libertà e democrazia, a cui sto per rivolgermi. Poiché proprio come il non-dominio richiede strettamente la democrazia, solo una democrazia può garantire la libertà individuale. I relativamente pochi episodi di autogoverno collettivo tra l'antichità e il diciannovesimo secolo presero forme diverse, naturalmente, così come la nozione di *civitas libera*, lo «stato libero»: ma l'idea che si possa essere liberi solo in tale stato è antica quasi quanto l'idea stessa di non-dominio. Pericle la proclamò nel 431 a.C., nell'orazione funebre che Tucidide riscrive, e quattro secoli dopo Livio la teorizzò indirettamente, narrando la nascita e l'ascesa della Repubblica Romana. Ma ancora più rivelatrici sono le parole di un avversario di quell'idea, il vescovo Ottone di Frisinga. Zio e cronista di Federico I Barbarossa, nel 1158 accompagnò e consigliò l'Imperatore in",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": " una fase della sua lunga e infine infruttuosa campagna per sottomettere quelle città dell'Italia settentrionale, che nel secolo precedente erano effettivamente diventate repubbliche autogovernate. I loro cittadini, commenta, «sono così desiderosi di libertà che, evitando l'insolenza del potere, sono governati dalla volontà di consoli [eletti] piuttosto che di sovrani».\n\n### Confronto: democrazia e legge\n\n> Ἔστι δὲ δημοκρατίας μὲν τέλος ἐλευθερία, ὀλιγαρχίας δὲ πλοῦτος...\n> *[Il fine della democrazia è la libertà, dell'oligarchia la ricchezza]*\n> (Aristotele, IV secolo a.C.)\n\nLa libertà è «distinta» dalla democrazia, dice Fukuyama. La maggior parte dei liberali non lo sono, ma la libertà liberale è anche indifferente a essa. Poiché se libertà significa non-interferenza, ne consegue che qualsiasi legge che costringa i cittadini lede la loro libertà. Se così è, tuttavia, ne consegue anche che la questione se quella legge sia stata adottata per deliberazione democratica o per decreto autocratico è irrilevante dalla prospettiva della libertà, poiché tutto ciò che conta è il puro fatto dell'interferenza. Su entrambi i punti non si potrebbero desiderare dichiarazioni più chiare di quelle di Berlin.\n\nSul primo, egli cita approvandolo Jeremy Bentham — sul cui ruolo tornerò — che dice che «ogni legge è una violazione della libertà». «Molta dell'ostilità neoliberale verso il governo è semplicemente irrazionale», ho citato prima Fukuyama dire: irrazionale, senza dubbio, ma pienamente coerente con la concezione liberale della libertà.\n\nSul secondo punto, Berlin afferma che la libertà «non è incompatibile con alcune forme di autocrazia, o almeno con l'assenza di autogoverno [perché] si occupa principalmente dell'area di controllo, non della sua fonte». (L'espressione «area di controllo» va letta, nelle parole della sua definizione che ho citato prima, come l'estensione in cui le leggi interferiscono all'interno dell'«area in cui [uno] potrebbe altrimenti agire».) Infatti, contin",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "ua Berlin,\n\n> Proprio come una democrazia può, di fatto, privare il singolo cittadino di moltissime libertà che potrebbe avere in qualche altra forma di società, così è perfettamente concepibile che un despota di mentalità liberale permetterebbe ai suoi sudditi un'ampia misura di libertà personale.\n\nBerlin era un democratico, e aggiunge che la democrazia generalmente protegge la libertà meglio dell'autocrazia. Ma insiste che\n\n> non c'è alcuna connessione necessaria tra libertà individuale e governo democratico. La risposta alla domanda «Chi mi governa?» è logicamente distinta dalla domanda «Fino a che punto il governo interferisce con me?»\n\n«È in questa differenza», conclude, «che consiste, alla fine, il grande contrasto tra i due concetti di libertà negativa e positiva». La chiarezza di questa conclusione è offuscata dalla sua definizione evolutiva di libertà positiva, che può riferirsi o all'autopadronanza o all'autorealizzazione. Ma questa questione non deve trattenerci. Ciò che va ritenuto è la sua avvincente dimostrazione che la non-interferenza è un valore separato dalla democrazia, compatibile con l'autocrazia, e quindi indifferente alla natura del regime politico.\n\nTale è la diffusione dell'espressione *democrazia liberale*, riflessivamente assunta per denotare una diade indivisibile, che il ragionamento di Berlin può suonare provocatorio. Anche perché voci influenti hanno spesso avanzato l'argomento opposto, seppure in termini un po' modificati. I libri più popolari di Hayek e Friedman, in particolare, scritti rispettivamente due e quattro anni dopo la conferenza di Berlin, affermano che le libertà economiche e politiche sono inseparabili, sia concettualmente che praticamente, e Wolf descrive similmente democrazia e mercato come «gemelli simbiotici». Queste idee contraddicono direttamente la visione di Berlin, poiché il suo «despota di mentalità liberale» può certamente elargire ampie libertà economiche ai suoi sudditi ma deve necessariamente restringere qu",
        "completezza": "unknown"
      },
      {
        "errori_trovati": [],
        "suggerimenti": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_corretto": "elle politiche. La contraddizione può non essere stata intenzionale, perché Hayek e Friedman scrivevano in difesa delle libertà economiche, che credevano fossero state eccessivamente vincolate negli anni Sessanta, e Wolf non stava discutendo cosa significhi libertà liberale — precisamente perché lui, Fukuyama, e molti altri sembrano aver interiorizzato la definizione di Berlin al punto da prenderla come l'unica o naturale. Il ragionamento di Berlin è invece avvincente, perché nel 1958 stava (di recente) costruendo quella definizione, e stava riflettendo attentamente sulle sue implicazioni.\n\nIl suo argomento formale è anche un necessario contrappunto all'affermazione empirica di Fukuyama che, dopo che la storia ha sposato democrazia e liberalismo, gli autoritari tipicamente attaccano prima il secondo e poi si rivolgono contro la prima. Questo può spesso essere stato vero. Ma quando Hayek e Friedman sostennero il colpo di stato del 1973 in Cile, o l'autocrazia che ne seguì, provarono invece il punto di Berlin, perché affermavano di agire in difesa della libertà. Da qui la mia precedente similitudine dei due motori e dei due cavalli, e la mia osservazione che un'ideologia che separa libertà e democrazia indebolisce entrambe, mettendole in pericolo.\n\n---\n\n## Due esempi contemporanei\n\nPer concludere questa discussione e introdurre l'ultimo elemento del mio confronto, cito due esempi del tipo di posizioni che, al di fuori dell'accademia, sono state agganciate alla visione liberale della libertà. Uno è tratto da un articolo pubblicato nella primavera del 2009, come intervento nell'acceso dibattito che allora infuriava negli Stati Uniti sulla riforma del settore finanziario — che alla fine diede risultati deludenti, come ho detto. L'autore è un imprenditore libertario, Peter Thiel, che più tardi sarebbe diventato un sostenitore di Trump, anche se incostante. «Non credo più che libertà e democrazia siano compatibili», scrisse sul giornale online del Cato Institute, rivolgend",
        "completezza": "unknown"
      }
    ],
    "revisore": [
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "# La Repubblica dell'Innovazione\n\n*Traduzione italiana*\n\n---\n\n## Introduzione alla concezione repubblicana della libertà\n\nNaturalmente, un'interferenza che frustra la mia preferenza è più dolorosa di una che non lo fa: ma ciò che lede la mia libertà è l'interferenza, non la frustrazione.\n\nEppure questa concezione è vulnerabile a un'obiezione parallela. Supponiamo che tu abbia il potere di interferire nella mia scelta su come trascorrere le mie serate; io lo so, e ti chiedo di non usare quel potere questa sera; tu accetti, e io vado al cinema. Sarebbe altrettanto assurdo descrivere la mia scelta come libera, perché era una conseguenza della temporanea rinuncia al tuo potere. Se la libertà fosse non-interferenza, tuttavia, e l'interferenza fosse vista come un mero fatto, come la visione liberale implica, allora la tua rinuncia renderebbe davvero libera la mia scelta, contraddicendo egualmente le nostre intuizioni. Lo stesso vale per esempi più forti, in cui ti prego, offro incentivi, o mi ingrazio preventivamente con te, così da distogliere la tua mente dall'interferire nelle mie serate. Si può evitare l'assurdità solo se ci si allontana dal vedere l'interferenza come un mero fatto e la si vede invece come una manifestazione di un *potere* di interferenza, che si rivela poi essere la vera lesione alla libertà. Ma compiere questo passo significa abbandonare la concezione liberale e assurgere a quella repubblicana.\n\nL'esempio mostra anche che se si è soggetti alla volontà di qualcun altro, qualsiasi azione si intraprenda è il risultato non di una, ma di due volontà: la propria, e quella del detentore del potere di interferenza, che ha autorizzato la sua azione. L'autorizzazione può essere esplicita, come nel mio esempio, o silenziosa, come nel caso dello schiavo il cui padrone è benevolo: ma ogni volta che quel potere può essere esercitato nessuna azione viene intrapresa senza qualche forma di permesso. Come gli schiavi dell'antichità, conclude Skinner, coloro che sono ",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "soggetti a un potere incontrollato di interferenza sono «incapaci di agire secondo la propria volontà indipendente in qualsiasi momento».\n\nLa concezione repubblicana non è esposta a obiezioni simili, poiché una persona soggetta a tale potere non ha altra opzione che l'acquiescenza o la ribellione. La prima strategia può essere individuale, come nel mio ultimo esempio, ed è compatibile con l'ingraziarsi il detentore di quel potere, poiché comporta l'accettazione di esso. La seconda strategia non può tipicamente essere individuale, ma richiede o un'azione collettiva o un'azione pubblica per estirpare quel potere: cioè, o un'azione collettiva per cambiare le leggi, se queste permettono il dominio, o un'azione pubblica per farle applicare, se lo proibiscono. Da qui l'approccio strumentale della teoria repubblicana alla virtù civica e alla partecipazione politica, che vengono presentate ai cittadini non come imperativi deontologici ma come modi per preservare la propria libertà: «il prezzo della libertà... è l'eterna vigilanza».\n\n---\n\n## Libertà e democrazia\n\nQueste ultime considerazioni gettano luce anche sui legami tra libertà e democrazia, a cui sto per rivolgermi. Poiché proprio come il non-dominio richiede strettamente la democrazia, solo una democrazia può garantire la libertà individuale. I relativamente pochi episodi di autogoverno collettivo tra l'antichità e il diciannovesimo secolo presero forme diverse, naturalmente, così come la nozione di *civitas libera*, lo «stato libero»: ma l'idea che si possa essere liberi solo in tale stato è antica quasi quanto l'idea stessa di non-dominio. Pericle la proclamò nel 431 a.C., nell'orazione funebre che Tucidide riscrive, e quattro secoli dopo Livio la teorizzò indirettamente, narrando la nascita e l'ascesa della Repubblica Romana. Ma ancora più rivelatrici sono le parole di un avversario di quell'idea, il vescovo Ottone di Frisinga. Zio e cronista di Federico I Barbarossa, nel 1158 accompagnò e consigliò l'Imperatore in",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": " una fase della sua lunga e infine infruttuosa campagna per sottomettere quelle città dell'Italia settentrionale, che nel secolo precedente erano effettivamente diventate repubbliche autogovernate. I loro cittadini, commenta, «sono così desiderosi di libertà che, evitando l'insolenza del potere, sono governati dalla volontà di consoli [eletti] piuttosto che di sovrani».\n\n### Confronto: democrazia e legge\n\n> Ἔστι δὲ δημοκρατίας μὲν τέλος ἐλευθερία, ὀλιγαρχίας δὲ πλοῦτος...\n> *[Il fine della democrazia è la libertà, dell'oligarchia la ricchezza]*\n> (Aristotele, IV secolo a.C.)\n\nLa libertà è «distinta» dalla democrazia, dice Fukuyama. La maggior parte dei liberali non lo sono, ma la libertà liberale è anche indifferente a essa. Poiché se libertà significa non-interferenza, ne consegue che qualsiasi legge che costringa i cittadini lede la loro libertà. Se così è, tuttavia, ne consegue anche che la questione se quella legge sia stata adottata per deliberazione democratica o per decreto autocratico è irrilevante dalla prospettiva della libertà, poiché tutto ciò che conta è il puro fatto dell'interferenza. Su entrambi i punti non si potrebbero desiderare dichiarazioni più chiare di quelle di Berlin.\n\nSul primo, egli cita approvandolo Jeremy Bentham — sul cui ruolo tornerò — che dice che «ogni legge è una violazione della libertà». «Molta dell'ostilità neoliberale verso il governo è semplicemente irrazionale», ho citato prima Fukuyama dire: irrazionale, senza dubbio, ma pienamente coerente con la concezione liberale della libertà.\n\nSul secondo punto, Berlin afferma che la libertà «non è incompatibile con alcune forme di autocrazia, o almeno con l'assenza di autogoverno [perché] si occupa principalmente dell'area di controllo, non della sua fonte». (L'espressione «area di controllo» va letta, nelle parole della sua definizione che ho citato prima, come l'estensione in cui le leggi interferiscono all'interno dell'«area in cui [uno] potrebbe altrimenti agire».) Infatti, contin",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "ua Berlin,\n\n> Proprio come una democrazia può, di fatto, privare il singolo cittadino di moltissime libertà che potrebbe avere in qualche altra forma di società, così è perfettamente concepibile che un despota di mentalità liberale permetterebbe ai suoi sudditi un'ampia misura di libertà personale.\n\nBerlin era un democratico, e aggiunge che la democrazia generalmente protegge la libertà meglio dell'autocrazia. Ma insiste che\n\n> non c'è alcuna connessione necessaria tra libertà individuale e governo democratico. La risposta alla domanda «Chi mi governa?» è logicamente distinta dalla domanda «Fino a che punto il governo interferisce con me?»\n\n«È in questa differenza», conclude, «che consiste, alla fine, il grande contrasto tra i due concetti di libertà negativa e positiva». La chiarezza di questa conclusione è offuscata dalla sua definizione evolutiva di libertà positiva, che può riferirsi o all'autopadronanza o all'autorealizzazione. Ma questa questione non deve trattenerci. Ciò che va ritenuto è la sua avvincente dimostrazione che la non-interferenza è un valore separato dalla democrazia, compatibile con l'autocrazia, e quindi indifferente alla natura del regime politico.\n\nTale è la diffusione dell'espressione *democrazia liberale*, riflessivamente assunta per denotare una diade indivisibile, che il ragionamento di Berlin può suonare provocatorio. Anche perché voci influenti hanno spesso avanzato l'argomento opposto, seppure in termini un po' modificati. I libri più popolari di Hayek e Friedman, in particolare, scritti rispettivamente due e quattro anni dopo la conferenza di Berlin, affermano che le libertà economiche e politiche sono inseparabili, sia concettualmente che praticamente, e Wolf descrive similmente democrazia e mercato come «gemelli simbiotici». Queste idee contraddicono direttamente la visione di Berlin, poiché il suo «despota di mentalità liberale» può certamente elargire ampie libertà economiche ai suoi sudditi ma deve necessariamente restringere qu",
        "qualita_stimata": "unknown"
      },
      {
        "problemi_stile": [],
        "problemi_fedelta": [],
        "suggerimenti_miglioramento": [
          "[TIMEOUT - risposta troppo lunga]"
        ],
        "testo_rivisto": "elle politiche. La contraddizione può non essere stata intenzionale, perché Hayek e Friedman scrivevano in difesa delle libertà economiche, che credevano fossero state eccessivamente vincolate negli anni Sessanta, e Wolf non stava discutendo cosa significhi libertà liberale — precisamente perché lui, Fukuyama, e molti altri sembrano aver interiorizzato la definizione di Berlin al punto da prenderla come l'unica o naturale. Il ragionamento di Berlin è invece avvincente, perché nel 1958 stava (di recente) costruendo quella definizione, e stava riflettendo attentamente sulle sue implicazioni.\n\nIl suo argomento formale è anche un necessario contrappunto all'affermazione empirica di Fukuyama che, dopo che la storia ha sposato democrazia e liberalismo, gli autoritari tipicamente attaccano prima il secondo e poi si rivolgono contro la prima. Questo può spesso essere stato vero. Ma quando Hayek e Friedman sostennero il colpo di stato del 1973 in Cile, o l'autocrazia che ne seguì, provarono invece il punto di Berlin, perché affermavano di agire in difesa della libertà. Da qui la mia precedente similitudine dei due motori e dei due cavalli, e la mia osservazione che un'ideologia che separa libertà e democrazia indebolisce entrambe, mettendole in pericolo.\n\n---\n\n## Due esempi contemporanei\n\nPer concludere questa discussione e introdurre l'ultimo elemento del mio confronto, cito due esempi del tipo di posizioni che, al di fuori dell'accademia, sono state agganciate alla visione liberale della libertà. Uno è tratto da un articolo pubblicato nella primavera del 2009, come intervento nell'acceso dibattito che allora infuriava negli Stati Uniti sulla riforma del settore finanziario — che alla fine diede risultati deludenti, come ho detto. L'autore è un imprenditore libertario, Peter Thiel, che più tardi sarebbe diventato un sostenitore di Trump, anche se incostante. «Non credo più che libertà e democrazia siano compatibili», scrisse sul giornale online del Cato Institute, rivolgend",
        "qualita_stimata": "unknown"
      }
    ]
  },
  "finale": ""
}