{
  "timestamp": "2026-02-18T03:00:03.646092+00:00",
  "sources": [
    "cointelegraph",
    "bitcoinmagazine",
    "decrypt"
  ],
  "failed_sources": [
    "coindesk"
  ],
  "article_count": 30,
  "results": [
    {
      "title": "eToro shares pop 20% as crypto revenues bolster Q4 earnings",
      "url": "https://cointelegraph.com/news/etoro-shares-pop-crypto-revenues-bolster-q4-earnings?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "eToro CEO Yoni Assia says he is positioning the trading platform “for a financial system that is increasingly moving on-chain,” after its crypto revenues boosted earnings in Q4.",
      "published": "2026-02-18T02:53:16+00:00"
    },
    {
      "title": "Zora debuts attention markets on Solana, betting on social trends",
      "url": "https://cointelegraph.com/news/zora-launches-attention-markets-solana?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The ZORA token gained 6.2% to $0.022 over the last 24 hours as Zora announced its new attention markets product.",
      "published": "2026-02-18T01:27:00+00:00"
    },
    {
      "title": "Federal Appeals Court Rejects Kalshi Bid to Pause Nevada Enforcement",
      "url": "https://decrypt.co/358364/federal-appeals-court-rejects-kalshi-bid-pause-nevada",
      "source": "decrypt",
      "description": "The ruling clears a path for state action, leaving predictions-market operator Kalshi with limited options, according to one legal expert.",
      "published": "2026-02-18T00:06:36+00:00"
    },
    {
      "title": "Why Bitcoin Open Interest Has Seen Its Largest Decline in Almost 3 Years",
      "url": "https://decrypt.co/358273/bitcoin-open-interest-largest-decline-april-2023",
      "source": "decrypt",
      "description": "Bitcoin open interest has plunged 55% from its October 2025 peak, marking the steepest decline since April 2023 as traders unwind leverage.",
      "published": "2026-02-17T23:31:56+00:00"
    },
    {
      "title": "Ether bulls target $2.5K as staking ETF launch, RWA market cap reflect growth",
      "url": "https://cointelegraph.com/news/ether-bulls-target-2-5k-as-staking-etf-launch-rwa-market-cap-reflect-growth?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Ether adoption grows as major endowments shift capital, BlackRock launches a staking ETF and Ethereum's real-world asset dominance highlights TradFi investor interest.",
      "published": "2026-02-17T23:09:19+00:00"
    },
    {
      "title": "Precious Metals Royalties Firm to Offer Dividends in Tether's Tokenized Gold",
      "url": "https://decrypt.co/358356/precious-metals-royalties-firm-dividends-tether-tokenized-gold",
      "source": "decrypt",
      "description": "Elemental Royalty said investors will be able to receive dividends in Tether’s XAUT, establishing a novel use case for tokenized gold.",
      "published": "2026-02-17T22:23:54+00:00"
    },
    {
      "title": "Stripe-Owned Bridge Gains National Bank Trust Charter to Boost Stablecoin Offerings",
      "url": "https://decrypt.co/358355/stripe-owned-bridge-national-bank-trust-charter-stablecoin-offerings",
      "source": "decrypt",
      "description": "Bridge, the stablecoin firm of payments giant Stripe, was awarded conditional approval for a national trust banking charter.",
      "published": "2026-02-17T22:13:49+00:00"
    },
    {
      "title": "Stripe-owned Bridge gets OCC conditional approval for national bank charter",
      "url": "https://cointelegraph.com/news/bridge-stripe-occ-approval-national-trust-bank?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "While still subject to final approval, the regulator's nod would enable Bridge to offer stablecoin and digital asset services to businesses.",
      "published": "2026-02-17T21:50:57+00:00"
    },
    {
      "title": "Quantoz gains Visa nod to issue stablecoin-linked debit cards in Europe",
      "url": "https://cointelegraph.com/news/quantoz-gains-visa-principal-membership-to-issue-stablecoin-linked-debit-cards-in-europe?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The Dutch electronic money issuer will act as a BIN sponsor for fintech partners, linking regulated dollar- and euro-denominated tokens to mainstream card rails.",
      "published": "2026-02-17T21:45:23+00:00"
    },
    {
      "title": "Coinbase CEO Brian Armstrong Addresses “Paper Bitcoin” Claims, Claims Bitcoin ETFs Are Fully Backed",
      "url": "https://bitcoinmagazine.com/news/coinbase-ceo-addresses-paper-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Coinbase CEO Brian Armstrong Addresses “Paper Bitcoin” Claims, Claims Bitcoin ETFs Are Fully Backed Coinbase CEO Brian Armstrong dismissed “paper Bitcoin” claims, insisting spot Bitcoin ETFs are fully backed, while defending Coinbase’s dominant custody role and calling U.S. regulatory clarity the next key step for the industry. This post Coinbase CEO Brian Armstrong Addresses “Paper Bitcoin” Claims, Claims Bitcoin ETFs Are Fully Backed first appeared on Bitcoin Magazine and is w",
      "published": "2026-02-17T21:24:20+00:00"
    },
    {
      "title": "HIVE Digital posts 219% revenue jump as miner-AI hybrid strategy gains traction",
      "url": "https://cointelegraph.com/news/hive-revenue-surge-artificial-intelligence-expansion-bitcoin-mining-pressure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Third-quarter results show revenue growth despite lower Bitcoin prices, alongside new AI computing contracts, as HIVE continues to expand beyond its core mining business.",
      "published": "2026-02-17T21:15:10+00:00"
    },
    {
      "title": "Abu Dhabi Funds Boosted BlackRock Bitcoin ETF Exposure to $1 Billion by End of 2025: Filings",
      "url": "https://decrypt.co/358351/abu-dhabi-funds-blackrock-bitcoin-etf-exposure-1-billion",
      "source": "decrypt",
      "description": "Abu Dhabi funds added to their Bitcoin exposure in Q4, jumping to more than $1 billion worth of IBIT at the conclusion of the year.",
      "published": "2026-02-17T21:12:46+00:00"
    },
    {
      "title": "Bitcoin Miner Bitdeer Overtakes MARA, Establishing Hash Rate Lead: JPMorgan",
      "url": "https://decrypt.co/358344/bitcoin-miner-bitdeer-overtakes-mara-hash-rate-lead-jpmorgan",
      "source": "decrypt",
      "description": "Bitcoin miner Bitdeer has overtaken MARA in terms of self-mining hash rate among publicly traded companies, according to JPMorgan analysts.",
      "published": "2026-02-17T20:35:28+00:00"
    },
    {
      "title": "New Bitcoin whales are trapped underwater, but for how long?",
      "url": "https://cointelegraph.com/news/new-bitcoin-whales-are-trapped-underwater-but-for-how-long?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The gap between new and old Bitcoin whales continues to widen as BTC trades below $68,000. Will young whales continue to accumulate, or will older whales capitulate first?",
      "published": "2026-02-17T20:30:00+00:00"
    },
    {
      "title": "Traders pinpoint three price targets for Bitcoin if $70K holds as resistance",
      "url": "https://cointelegraph.com/news/traders-pinpoint-three-price-targets-for-bitcoin-if-dollar70k-holds-as-resistance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Traders map out their desired price targets for Bitcoin if the $70,000 level continues to function as a resistance zone. Is there any hope for the bulls?",
      "published": "2026-02-17T19:45:00+00:00"
    },
    {
      "title": "Bitcoin chart pattern, whale activity warn of another 20% price drop",
      "url": "https://cointelegraph.com/news/bitcoin-chart-pattern-whale-activity-warn-of-another-20-price-drop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin has formed a classic bearish pattern on its daily chart, and if confirmed, a price drop to $56,000 could be on the cards.",
      "published": "2026-02-17T19:15:00+00:00"
    },
    {
      "title": "Kraken integrates with ICE Chat to expand institutional OTC access",
      "url": "https://cointelegraph.com/news/kraken-integrates-with-ice-chat-to-expand-institutional-otc-access?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The integration gives ICE Chat users direct access to the exchange's OTC crypto liquidity, embedding digital asset trading within established institutional workflows.",
      "published": "2026-02-17T19:03:45+00:00"
    },
    {
      "title": "Gemini Stock Dives as Winklevoss-Led Crypto Exchange Dumps Executives",
      "url": "https://decrypt.co/358325/gemini-stock-dives-winklevoss-crypto-exchange-dumps-executives",
      "source": "decrypt",
      "description": "Shares in publicly traded crypto exchange Gemini are plunging as the firm parts ways with three executives following broader layoffs.",
      "published": "2026-02-17T18:40:42+00:00"
    },
    {
      "title": "Abu Dhabi’s Mubadala Boosts Bitcoin ETF Holdings to $630 Million",
      "url": "https://bitcoinmagazine.com/news/abu-dhabis-boosts-bitcoin-holdings-to-630",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Abu Dhabi’s Mubadala Boosts Bitcoin ETF Holdings to $630 Million Abu Dhabi investment vehicles together held over 20 million shares of BlackRock’s Bitcoin IBIT at the close of last year, with a combined value exceeding $1.1 billion. This post Abu Dhabi’s Mubadala Boosts Bitcoin ETF Holdings to $630 Million first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-17T18:28:06+00:00"
    },
    {
      "title": "Satoshi’s Exercise for the Reader",
      "url": "https://bitcoinmagazine.com/print/satoshis-exercise-for-the-reader",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Satoshi’s Exercise for the Reader The Bitcoin whitepaper is clear about Bitcoin’s core feature: it is permissionless. Anyone in the world can pay anyone by joining the peer-to-peer network and broadcasting a transaction. Proof of Work consensus even empowers anybody to become a block producer, and means that the only way to reverse a payment is to overpower everyone else [&#8230;] This post Satoshi’s Exercise for the Reader first appeared on Bitcoin Magazine and is written by Gl",
      "published": "2026-02-17T17:50:41+00:00"
    },
    {
      "title": "Tom Lee Expects 'Defining Year for Ethereum' as BitMine Buys ETH Amid 'Rock Bottom' Vibes",
      "url": "https://decrypt.co/358322/tom-lee-defining-year-ethereum-bitmine-buys-eth-rock-bottom-vibes",
      "source": "decrypt",
      "description": "BitMine Immersion Technologies is sitting on a nearly $8 billion unrealized loss, but Tom Lee remains optimistic about Ethereum.",
      "published": "2026-02-17T16:54:18+00:00"
    },
    {
      "title": "Is the Netherlands Taxing Unrealized Crypto Gains? It's Complicated",
      "url": "https://decrypt.co/358312/is-the-netherlands-taxing-unrealized-crypto-gains-its-complicated",
      "source": "decrypt",
      "description": "From 2028, the Netherlands will update how tax is calculated on unrealized gains. Crypto critics are in uproar—but the reality is nuanced.",
      "published": "2026-02-17T16:15:59+00:00"
    },
    {
      "title": "Strategy’s Bitcoin Buying Accelerates as $48 Billion BTC Stash Sits Underwater",
      "url": "https://decrypt.co/358313/strategys-bitcoin-buying-accelerates-48-billion-btc-stash-underwater",
      "source": "decrypt",
      "description": "Strategy reported its fourth-largest Bitcoin purchase of the year, a week after Michael Saylor's defense of the company's became a meme.",
      "published": "2026-02-17T16:13:42+00:00"
    },
    {
      "title": "Abu Dhabi’s Al Warda Raises Bitcoin ETF Stake to 8.2 Million IBIT Shares in Q4 Filing",
      "url": "https://bitcoinmagazine.com/news/ai-warda-raises-ibit-bitcoin-etf-stake",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Abu Dhabi’s Al Warda Raises Bitcoin ETF Stake to 8.2 Million IBIT Shares in Q4 Filing Abu Dhabi’s Al Warda Investments increased its bitcoin exposure via BlackRock’s IBIT to 8.2 million shares by the end of 2025. This post Abu Dhabi’s Al Warda Raises Bitcoin ETF Stake to 8.2 Million IBIT Shares in Q4 Filing first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-17T15:58:51+00:00"
    },
    {
      "title": "Strategy ($MSTR) Buys $168M in Bitcoin, Expands Holdings to 717,131 BTC",
      "url": "https://bitcoinmagazine.com/news/strategy-mstr-buys-168m-in-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Strategy ($MSTR) Buys $168M in Bitcoin, Expands Holdings to 717,131 BTC Strategy bought $168.4 million in Bitcoin last week, continuing its long-running accumulation strategy. This post Strategy ($MSTR) Buys $168M in Bitcoin, Expands Holdings to 717,131 BTC first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-17T14:39:23+00:00"
    },
    {
      "title": "Nakamoto Inc. ($NAKA) to Acquire BTC Inc and UTXO Management",
      "url": "https://bitcoinmagazine.com/featured/nakamoto-to-acquire-btcinc-utxo-management",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Nakamoto Inc. ($NAKA) to Acquire BTC Inc and UTXO Management Nakamoto Inc. announced today that it has entered into merger agreements to acquire BTC Inc. and UTXO Management GP, LLC. This post Nakamoto Inc. ($NAKA) to Acquire BTC Inc and UTXO Management first appeared on Bitcoin Magazine and is written by Nik and Micah Zimmerman.",
      "published": "2026-02-17T13:38:09+00:00"
    },
    {
      "title": "Metaplanet Reports $619 Million Loss as Bitcoin Holdings Take Hit",
      "url": "https://bitcoinmagazine.com/news/metaplanet-reports-619-million-loss",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Metaplanet Reports $619 Million Loss as Bitcoin Holdings Take Hit Tokyo-based bitcoin treasury firm Metaplanet reported a fiscal 2025 net loss of 95 billion yen ($619 million), largely due to a 102.2 billion yen ($666 million) drop in the value of its bitcoin holdings. This post Metaplanet Reports $619 Million Loss as Bitcoin Holdings Take Hit first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-16T18:49:54+00:00"
    },
    {
      "title": "Bitcoin Bears Dominate: Failure to Break $71,800 Keeps Downside Risk Alive",
      "url": "https://bitcoinmagazine.com/markets/bitcoin-bears-dominate-failure-to-break-71800-keeps-downside-risk-alive",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Bears Dominate: Failure to Break $71,800 Keeps Downside Risk Alive Key levels in focus: $65,650 support holds for now, but break below opens $63,000 then Fibonacci $57,800; resistance caps upside at $71,800–$74,500. This post Bitcoin Bears Dominate: Failure to Break $71,800 Keeps Downside Risk Alive first appeared on Bitcoin Magazine and is written by Ethan Greene - Feral Analysis and Juan Galt.",
      "published": "2026-02-16T18:21:12+00:00"
    },
    {
      "title": "Payjoin Foundation Gains 501(c)(3) Status, Enabling Tax-Deductible Donations for Bitcoin Privacy Development",
      "url": "https://bitcoinmagazine.com/business/payjoin-foundation-gains-501c3-status-enabling-tax-deductible-donations-for-bitcoin-privacy-development",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Payjoin Foundation Gains 501(c)(3) Status, Enabling Tax-Deductible Donations for Bitcoin Privacy Development Payjoin Foundation, the nonprofit behind the Payjoin Dev Kit, has secured 501(c)(3) status from the IRS, making U.S. donations tax-deductible and accelerating development of privacy-enhancing Bitcoin protocols. This post Payjoin Foundation Gains 501(c)(3) Status, Enabling Tax-Deductible Donations for Bitcoin Privacy Development first appeared on Bitcoin Magazine and is wr",
      "published": "2026-02-16T16:49:49+00:00"
    },
    {
      "title": "Trump Family-Backed American Bitcoin Keeps Stacking Bitcoin, Holdings Pass 6,000 BTC",
      "url": "https://bitcoinmagazine.com/news/american-bitcoin-keeps-stacking-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Trump Family-Backed American Bitcoin Keeps Stacking Bitcoin, Holdings Pass 6,000 BTC American Bitcoin (ABTC) has pushed its Bitcoin reserves past 6,000 BTC. This post Trump Family-Backed American Bitcoin Keeps Stacking Bitcoin, Holdings Pass 6,000 BTC first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-16T16:20:25+00:00"
    }
  ]
}