{
  "timestamp": "2026-02-16T15:00:04.360241+00:00",
  "sources": [
    "cointelegraph",
    "bitcoinmagazine",
    "decrypt"
  ],
  "failed_sources": [
    "coindesk"
  ],
  "article_count": 30,
  "results": [
    {
      "title": "Binance Founder CZ: Privacy 'Missing Link' for Crypto Payments Adoption",
      "url": "https://decrypt.co/358153/binance-founder-cz-privacy-missing-link-for-crypto-payments-adoption",
      "source": "decrypt",
      "description": "Changpeng Zhao called on the industry to prioritise crypto privacy features, arguing that the gap is holding back mainstream adoption.",
      "published": "2026-02-16T14:44:13+00:00"
    },
    {
      "title": "Crypto services platform Nexo relaunches in the United States",
      "url": "https://cointelegraph.com/news/nexo-relaunch-united-states?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Nexo exited the US in 2022, citing regulatory hostility toward the crypto industry from federal and state financial regulators.",
      "published": "2026-02-16T14:37:41+00:00"
    },
    {
      "title": "Ray Dalio’s world order warning revives case for Bitcoin as neutral money",
      "url": "https://cointelegraph.com/news/dalio-collapse-world-order-permissionless-money?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Ray Dalio warns that the rules‑based order is now over, putting monetary debasement, dollar risk and neutral, permissionless financial rails back at the center of the macro conversation.",
      "published": "2026-02-16T14:26:33+00:00"
    },
    {
      "title": "Harvard Trims Bitcoin Position by 21% in Q4 Portfolio Shift",
      "url": "https://bitcoinmagazine.com/news/harvard-trims-bitcoin-position",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Harvard Trims Bitcoin Position by 21% in Q4 Portfolio Shift Harvard trimmed its Bitcoin holdings by 21% in the fourth quarter while establishing its first-ever position in Ethereum. This post Harvard Trims Bitcoin Position by 21% in Q4 Portfolio Shift first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-16T14:23:38+00:00"
    },
    {
      "title": "Here’s what happened in crypto today",
      "url": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
      "published": "2026-02-16T14:01:21+00:00"
    },
    {
      "title": "When will crypto’s CLARITY Act framework pass in the US Senate?",
      "url": "https://cointelegraph.com/news/when-will-crypto-clarity-act-law-pass?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The CLARITY Act moved quickly through the House of Representatives since it was introduced in June 2025 but has been plagued with delays in the Senate.",
      "published": "2026-02-16T13:08:15+00:00"
    },
    {
      "title": "Metaplanet revenue jumps 738% as Bitcoin generates 95% of sales",
      "url": "https://cointelegraph.com/news/metaplanet-revenue-jumps-738-percent-bitcoin-generates-95-percent-revenue?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Metaplanet reported about $40 million in operating profit but still recorded a $619 million net loss amid the Bitcoin price drop.",
      "published": "2026-02-16T12:10:52+00:00"
    },
    {
      "title": "Binance denies report on Iran-linked sanctions breaches and investigator firings",
      "url": "https://cointelegraph.com/news/binance-denies-iran-sanctions-report-fortune?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Binance said an internal review with external counsel found no sanctions violations and that it continues to meet its regulatory obligations under monitoring and oversight.",
      "published": "2026-02-16T11:09:48+00:00"
    },
    {
      "title": "Animoca Granted Dubai License Amid Stricter Crypto Oversight",
      "url": "https://decrypt.co/358149/animoca-granted-dubai-license-amid-stricter-crypto-oversight",
      "source": "decrypt",
      "description": "Animoca Brands calls Dubai a strategic hub for institutional clients as the emirate builds compliance-driven crypto markets.",
      "published": "2026-02-16T10:57:46+00:00"
    },
    {
      "title": "$75K or bearish ‘regime shift?’ Five things to know in Bitcoin this week",
      "url": "https://cointelegraph.com/news/75k-or-bearish-regime-shift-five-things-to-know-in-bitcoin-this-week?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin market analysis focused on liquidations and the wick to $59,000 for signs of the next significant BTC price move on lower time frames.",
      "published": "2026-02-16T10:41:38+00:00"
    },
    {
      "title": "Crypto Traders Rotate Into Select Altcoins as Bitcoin Stalls",
      "url": "https://decrypt.co/358144/crypto-traders-rotate-into-select-altcoins-as-bitcoin-stalls",
      "source": "decrypt",
      "description": "Altcoins notch double-digit weekly gains as Bitcoin remains rangebound, but most remain well below all-time highs with macro data looming.",
      "published": "2026-02-16T10:37:23+00:00"
    },
    {
      "title": "Crypto funds log fourth week of outflows at $173M as BTC dips below $70K",
      "url": "https://cointelegraph.com/news/crypto-etf-4-week-outflows-173-million-btc-below-70k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Crypto funds saw $173 million outflows last week as Bitcoin and Ether slipped, while XRP and Solana bucked the trend across global markets.",
      "published": "2026-02-16T09:59:52+00:00"
    },
    {
      "title": "Willy Woo warns quantum risk is eroding Bitcoin’s edge over gold",
      "url": "https://cointelegraph.com/news/willy-woo-bitcoin-quantum-risk-gold-lost-coins-post-quantum-upgrade?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Onchain analyst Willy Woo says markets are starting to price in the quantum threat, putting 4 million “lost” BTC and a 12‑year valuation uptrend versus gold into question.",
      "published": "2026-02-16T09:42:50+00:00"
    },
    {
      "title": "OKX secures EU payment license to expand stablecoin services",
      "url": "https://cointelegraph.com/news/okx-secures-eu-payment-license-to-expand-stablecoin-services?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "OKX secured a Malta payment institution license to support EU-compliant stablecoin services, including OKX Pay and the OKX Card.",
      "published": "2026-02-16T09:12:58+00:00"
    },
    {
      "title": "OpenAI Taps OpenClaw Founder to Lead Push Into Personal AI Agents",
      "url": "https://decrypt.co/358141/openai-openclaw-founder-lead-push-personal-ai-agents",
      "source": "decrypt",
      "description": "The founder said he is turning OpenClaw into a foundation, calling OpenAI the fastest way to bring open agents to everyone.",
      "published": "2026-02-16T05:33:38+00:00"
    },
    {
      "title": "UK Prime Minister Seeks New Powers to Regulate AI Chatbots as Child Safety Concerns Mount",
      "url": "https://decrypt.co/358138/uk-prime-minister-seeks-new-powers-regulate-ai-chatbots",
      "source": "decrypt",
      "description": "The move would bring AI chatbots under UK online safety laws, enabling rapid age limits and feature curbs to protect children.",
      "published": "2026-02-16T05:13:09+00:00"
    },
    {
      "title": "Bitcoin Leverage Heats Up as Traders Bet on Price Rebound",
      "url": "https://decrypt.co/358134/bitcoin-leverage-heats-up-as-traders-bet-on-price-rebound",
      "source": "decrypt",
      "description": "Bitcoin's futures basis has widened amid retail dip buying surges, but one expert warns the setup may end in an \"over-leveraged shakeout.\"",
      "published": "2026-02-16T04:24:00+00:00"
    },
    {
      "title": "Hollywood’s AI Crackdown Opens Door for Copyright Detection Startups",
      "url": "https://decrypt.co/358131/hollywoods-ai-crackdown-copyright-detection-startups",
      "source": "decrypt",
      "description": "Studios are escalating pressure on AI developers, as new tools aim to document whether generative models are trained on copyrighted material.",
      "published": "2026-02-16T02:49:10+00:00"
    },
    {
      "title": "OpenClaw Creator Gets Big Offers to Acquire AI Sensation—Will It Stay Open Source?",
      "url": "https://decrypt.co/358129/openclaw-creator-offers-acquire-ai-sensation-stay-open-source",
      "source": "decrypt",
      "description": "Peter Steinberger's open-source AI agent OpenClaw hit 180,000 GitHub stars and spawned MoltBook chaos. Now Meta and OpenAI want to buy it, but he's determined to keep it free.",
      "published": "2026-02-15T20:01:03+00:00"
    },
    {
      "title": "Her Divorce Was Ugly. Crypto Became a Lifeline",
      "url": "https://decrypt.co/358087/her-divorce-ugly-crypto-lifeline",
      "source": "decrypt",
      "description": "A mother in Texas said that crypto helped her overcome financial abuse.",
      "published": "2026-02-15T18:01:02+00:00"
    },
    {
      "title": "Bitcoin Takes Step Towards Quantum Fix as Experts Diverge on Urgency of Threat",
      "url": "https://decrypt.co/358068/bitcoin-quantum-fix-experts-diverge-urgency-threat",
      "source": "decrypt",
      "description": "Bitcoin developers lay the groundwork for post-quantum upgrades, but experts vary on whether the threat is years or decades away.",
      "published": "2026-02-15T16:17:16+00:00"
    },
    {
      "title": "Bitcoin Price Reclaims $70,000 After Deep February Slide",
      "url": "https://bitcoinmagazine.com/markets/bitcoin-price-reclaims-70000-after-feb",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Price Reclaims $70,000 After Deep February Slide After a rough sell-off that dragged BTC near $60,000, the bitcoin price has rebounded above $70,000. This post Bitcoin Price Reclaims $70,000 After Deep February Slide first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-15T05:00:44+00:00"
    },
    {
      "title": "How Silent.Link Solves SIM-Swap Risks and Roaming Hassles for Traveling Bitcoiners",
      "url": "https://bitcoinmagazine.com/business/how-silent-link-solves-sim-swap-risks-and-roaming-hassles-for-traveling-bitcoiners",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine How Silent.Link Solves SIM-Swap Risks and Roaming Hassles for Traveling Bitcoiners Silent.Link eliminates SIM-swap attacks via eSIM backup codes and automates seamless roaming across 160+ countries, bypassing censorship like China's Great Firewall. This post How Silent.Link Solves SIM-Swap Risks and Roaming Hassles for Traveling Bitcoiners first appeared on Bitcoin Magazine and is written by Juan Galt.",
      "published": "2026-02-13T21:11:47+00:00"
    },
    {
      "title": "Coinbase (COIN) Surges 18%, Strategy (MSTR) Jumps 10% as Crypto Stocks Jump ",
      "url": "https://bitcoinmagazine.com/markets/coinbase-surges-18-strategy-mstr-jumps",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Coinbase (COIN) Surges 18%, Strategy (MSTR) Jumps 10% as Crypto Stocks Jump Crypto-linked stocks jumped as Coinbase (COIN) surged 18% and Strategy (MSTR) rose 10%, fueled by a rebound in Bitcoin and renewed investor interest in digital-asset exposure. This post Coinbase (COIN) Surges 18%, Strategy (MSTR) Jumps 10% as Crypto Stocks Jump first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T20:58:12+00:00"
    },
    {
      "title": "White House Executive Director: Trillions Are Waiting To Enter Bitcoin And Crypto, Working Hard on Market Structure Bill",
      "url": "https://bitcoinmagazine.com/news/white-house-trillions-waiting-crypto",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine White House Executive Director: Trillions Are Waiting To Enter Bitcoin And Crypto, Working Hard on Market Structure Bill The White House executive director said trillions are poised to enter Bitcoin and crypto, emphasizing ongoing work on a market structure bill. This post White House Executive Director: Trillions Are Waiting To Enter Bitcoin And Crypto, Working Hard on Market Structure Bill first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T18:22:28+00:00"
    },
    {
      "title": "Brazil Proposes National Bitcoin Reserve, Targets 1 Million BTC Over Five Years",
      "url": "https://bitcoinmagazine.com/news/brazil-proposes-national-bitcoin-reserve",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Brazil Proposes National Bitcoin Reserve, Targets 1 Million BTC Over Five Years Brazilian lawmakers have reintroduced a bill proposing the creation of a Strategic Sovereign Bitcoin Reserve (RESBit) to acquire one million Bitcoin over five years. This post Brazil Proposes National Bitcoin Reserve, Targets 1 Million BTC Over Five Years first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T16:58:53+00:00"
    },
    {
      "title": "Lightning Labs Rolls Out AI Agent Tools to Help With Bitcoin Transactions on Lightning Network",
      "url": "https://bitcoinmagazine.com/news/lightning-labs-rolls-out-ai-agent-tools",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Lightning Labs Rolls Out AI Agent Tools to Help With Bitcoin Transactions on Lightning Network Lightning Labs released a new toolkit that enables AI agents to operate directly on the Bitcoin Lightning Network. This post Lightning Labs Rolls Out AI Agent Tools to Help With Bitcoin Transactions on Lightning Network first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T16:49:58+00:00"
    },
    {
      "title": "U.S. Treasury: Congress Needs to Pass Crypto Legislation This Spring ",
      "url": "https://bitcoinmagazine.com/news/congress-needs-to-pass-crypto-legislation",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine U.S. Treasury: Congress Needs to Pass Crypto Legislation This Spring U.S. Treasury Secretary Scott Bessent is urging lawmakers to deliver crypto legislation to President Donald Trump’s desk for signature this spring. This post U.S. Treasury: Congress Needs to Pass Crypto Legislation This Spring first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T14:35:55+00:00"
    },
    {
      "title": "Binance France CEO Targeted in Failed Home Invasion Near Paris, Three Arrested",
      "url": "https://bitcoinmagazine.com/news/binance-france-ceo-targeted-in-invasion",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Binance France CEO Targeted in Failed Home Invasion Near Paris, Three Arrested Binance France CEO David Prinçay was targeted in a failed home invasion near Paris on Feb. 12. French police arrested three suspects. This post Binance France CEO Targeted in Failed Home Invasion Near Paris, Three Arrested first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-13T14:10:21+00:00"
    },
    {
      "title": "Thailand Moves to Cement Bitcoin and Digital Assets in Regulated Derivatives Market",
      "url": "https://bitcoinmagazine.com/news/thailand-moves-to-cement-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Thailand Moves to Cement Bitcoin and Digital Assets in Regulated Derivatives Market Thailand is moving to cement bitcoin and other digital assets as legitimate, regulated reference assets in its derivatives and capital markets. This post Thailand Moves to Cement Bitcoin and Digital Assets in Regulated Derivatives Market first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-12T20:07:39+00:00"
    }
  ]
}