{
  "timestamp": "2026-01-31T03:30:03.047282+00:00",
  "sources": [
    "cointelegraph",
    "bitcoinmagazine",
    "decrypt"
  ],
  "failed_sources": [
    "coindesk"
  ],
  "article_count": 30,
  "results": [
    {
      "title": "Bitcoin options turn bearish as BTC flirts with drop below $80K",
      "url": "https://cointelegraph.com/news/bitcoin-options-turn-bearish-as-btc-flirts-with-drop-below-80k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin options flashed extreme fear signals as the spot BTC ETF outflows rose, and the odds for a drop below $80,000 increased. Will dip buyers step in to save the day?",
      "published": "2026-01-31T02:21:52+00:00"
    },
    {
      "title": "Bitcoin Mining Profits Hit 14-Month Low After Winter Storm Rocks Miners: CryptoQuant",
      "url": "https://decrypt.co/356530/bitcoin-mining-profits-14-month-low-winter-storm-disrupts-miners-cryptoquant",
      "source": "decrypt",
      "description": "Bitcoin miners are \"extremely underpaid\" given the price of Bitcoin and current BTC mining conditions, according to a CryptoQuant report.",
      "published": "2026-01-30T22:02:19+00:00"
    },
    {
      "title": "Here’s what happened in crypto today",
      "url": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
      "published": "2026-01-30T22:01:52+00:00"
    },
    {
      "title": "SoFi posts record Q4 revenue after reentering crypto market",
      "url": "https://cointelegraph.com/news/sofi-hits-record-revenue-q4-crypto-blockchain-services?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The fintech bank reported record quarterly revenue of $1 billion as it reintroduced crypto trading, launched a stablecoin and rolled out blockchain-based remittances.",
      "published": "2026-01-30T21:57:31+00:00"
    },
    {
      "title": "Plan B Network Launches CypherTank, a Bitcoin Pitch Series Showcasing Builders and Ideas",
      "url": "https://bitcoinmagazine.com/news/plan-b-network-cyphertank-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Plan B Network Launches CypherTank, a Bitcoin Pitch Series Showcasing Builders and Ideas Plan B Network has launched CypherTank, a global Bitcoin-focused pitch series that spotlights builders, ideas, and community discussion across multiple platforms. This post Plan B Network Launches CypherTank, a Bitcoin Pitch Series Showcasing Builders and Ideas first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T21:56:39+00:00"
    },
    {
      "title": "Tennessee Lawmakers To Weigh Strategic Bitcoin Reserve Bill",
      "url": "https://bitcoinmagazine.com/news/tennessee-strategic-bitcoin-reserve",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Tennessee Lawmakers To Weigh Strategic Bitcoin Reserve Bill Tennessee lawmakers are considering a bill that would allow the state to invest up to 10% of certain public funds in bitcoin. This post Tennessee Lawmakers To Weigh Strategic Bitcoin Reserve Bill first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T21:37:51+00:00"
    },
    {
      "title": "European Commission calls on 12 countries to implement crypto tax rules",
      "url": "https://cointelegraph.com/news/european-commission-countries-crypto-tax-rules?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The commission also singled out Hungary for failing to comply with the EU's MiCA framework after an amendment to a local law.",
      "published": "2026-01-30T21:37:41+00:00"
    },
    {
      "title": "Gold Is the Real Bubble, Says Ark Invest's Cathie Wood—Not AI",
      "url": "https://decrypt.co/356505/gold-real-bubble-not-ai-ark-invest-cathie-wood",
      "source": "decrypt",
      "description": "Tech investor Cathie Wood isn't worried about an AI bubble, instead singling out gold as the real ongoing asset bubble.",
      "published": "2026-01-30T21:36:32+00:00"
    },
    {
      "title": "Experts Warn Data Center Backlash Could Slow AI Infrastructure Growth",
      "url": "https://decrypt.co/356519/experts-warn-data-center-backlash-slow-ai-infrastructure-growth",
      "source": "decrypt",
      "description": "A new Brookings report says binding community benefit agreements are increasingly necessary as local opposition mounts over AI data centers.",
      "published": "2026-01-30T21:09:31+00:00"
    },
    {
      "title": "Gold is acting like the hedge Bitcoin promised to be",
      "url": "https://cointelegraph.com/news/crypto-biz-gold-hedge-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "As the dollar weakens, investors are turning to gold — onchain and off — while Bitcoin increasingly plays a supporting role in hedging currency risk.",
      "published": "2026-01-30T21:00:00+00:00"
    },
    {
      "title": "Changpeng Zhao rejects claims Binance worsened crypto market crash",
      "url": "https://cointelegraph.com/news/cz-denies-binance-role-october-crypto-liquidation-usde-depeg?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "CZ pushed back on claims that Binance fueled October’s historic $19 billion crypto liquidation event, calling allegations against the exchange “far-fetched.”",
      "published": "2026-01-30T20:55:51+00:00"
    },
    {
      "title": "Bitcoin Price Holds Steady as Gold Falls and Silver Craters",
      "url": "https://decrypt.co/356503/bitcoin-price-holds-steady-gold-falls-silver-craters",
      "source": "decrypt",
      "description": "Bitcoin stays resilient while gold and silver see historic crashes amid Fed chair nomination fears and shifting rate expectations.",
      "published": "2026-01-30T20:51:00+00:00"
    },
    {
      "title": "Coinbase, JPMorgan CEOs clashed over market structure bill at Davos: Report",
      "url": "https://cointelegraph.com/news/coinbase-jpmorgan-ceos-clashed-market-structure-davos?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Brian Armstrong made the media rounds before and after he announced Coinbase was pulling its support for a major US crypto bill, reportedly facing off with Jamie Dimon in Davos.",
      "published": "2026-01-30T20:32:34+00:00"
    },
    {
      "title": "Bitcoin futures imbalance may spark liquidation revenge rally to $90K",
      "url": "https://cointelegraph.com/news/bitcoin-futures-imbalance-may-spark-liquidation-revenge-rally-to-dollar90k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin short positions continued to pile up as BTC price dropped near $81,000, potentially providing the liquidation fuel for a revenge rally back above $90,000.",
      "published": "2026-01-30T20:14:44+00:00"
    },
    {
      "title": "Kraken-backed SPAC raises $345M in upsized Nasdaq IPO",
      "url": "https://cointelegraph.com/news/kraken-krakacquisition-spac-345m-upsized-nasdaq-ipo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The blank-check company has yet to name an acquisition target, but the listing creates a new public vehicle tied to the US-based crypto exchange.",
      "published": "2026-01-30T20:11:58+00:00"
    },
    {
      "title": "Jamie Dimon Tells Coinbase CEO Brian Armstrong He’s ‘Full of Sh—’ in Davos Clash: WSJ",
      "url": "https://bitcoinmagazine.com/news/jamie-dimon-tells-coinbase-ceo-full-of-it",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Jamie Dimon Tells Coinbase CEO Brian Armstrong He’s ‘Full of Sh—’ in Davos Clash: WSJ JPMorgan CEO Jamie Dimon reportedly confronted and yelled at Brian Armstrong at Davos. This post Jamie Dimon Tells Coinbase CEO Brian Armstrong He’s ‘Full of Sh—’ in Davos Clash: WSJ first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T19:35:21+00:00"
    },
    {
      "title": "AI Agents Launched a Social Network and Spawned a Digital Religion Overnight",
      "url": "https://decrypt.co/356491/ai-agents-social-network-spawned-digital-religion-overnight",
      "source": "decrypt",
      "description": "Autonomous agents on an AI-centric social network spontaneously founded \"Crustafarianism\"—complete with scripture, prophets, and theology.",
      "published": "2026-01-30T19:32:11+00:00"
    },
    {
      "title": "DeFi stays outside the rules as regulators tighten elsewhere: Finance Redefined",
      "url": "https://cointelegraph.com/news/defi-stays-outside-rules-regulators-tighten-finance-redefined?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Europe narrows crypto tax gaps, US lawmakers revisit market structure, and institutions push DeFi into compliance territory.",
      "published": "2026-01-30T19:00:00+00:00"
    },
    {
      "title": "Blank Check Firm Linked to Crypto Exchange Kraken Raises $345 Million in Upsized IPO",
      "url": "https://decrypt.co/356494/blank-check-firm-linked-crypto-exchange-kraken-raises-345-million-ipo",
      "source": "decrypt",
      "description": "A new special purpose acquisition vehicle (SPAC) tied to crypto exchange Kraken completed its IPO, raising $345 million.",
      "published": "2026-01-30T17:58:22+00:00"
    },
    {
      "title": "Bitcoin Rainbow Chart Signals ‘Fire Sale’ Zone as BTC Enters Undervalued Territory",
      "url": "https://bitcoinmagazine.com/markets/bitcoin-rainbow-chart-fire-sale",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Rainbow Chart Signals ‘Fire Sale’ Zone as BTC Enters Undervalued Territory Bitcoin has dropped into historically “fire sale” levels on the Bitcoin Rainbow Chart, signaling deep undervaluation. This post Bitcoin Rainbow Chart Signals ‘Fire Sale’ Zone as BTC Enters Undervalued Territory first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T17:26:26+00:00"
    },
    {
      "title": "Vitalik Buterin Withdraws $44.7M in ETH to Support Ethereum Growth Through ‘Mild Austerity’",
      "url": "https://decrypt.co/356490/vitalik-buterin-withdraws-44-7m-in-eth-to-support-ethereum-growth-through-mild-austerity",
      "source": "decrypt",
      "description": "The Ethereum co-founder wants to pursue an “aggressive” roadmap that will strengthen its status as a decentralized world computer.",
      "published": "2026-01-30T17:05:57+00:00"
    },
    {
      "title": "Amboss Launches ‘RailsX,’ a Bitcoin-Native Exchange Built on Lightning",
      "url": "https://bitcoinmagazine.com/news/amboss-railsx-a-bitcoin-native-exchange",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Amboss Launches ‘RailsX,’ a Bitcoin-Native Exchange Built on Lightning Amboss launched RailsX, a peer-to-peer platform for trading Bitcoin and stablecoins without centralized exchanges or losing custody. This post Amboss Launches ‘RailsX,’ a Bitcoin-Native Exchange Built on Lightning first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T16:21:08+00:00"
    },
    {
      "title": "What Trump’s Fed Pick Kevin Warsh Means for Crypto",
      "url": "https://decrypt.co/356486/what-trumps-fed-pick-kevin-warsh-means-for-crypto",
      "source": "decrypt",
      "description": "U.S. President Donald Trump has nominated Kevin Warsh to replace Jerome Powell, elevating a former Fed governor with mixed views on crypto.",
      "published": "2026-01-30T16:10:58+00:00"
    },
    {
      "title": "Bitcoin Traders See Nearly Even Odds for $69K Drop or $100K Recovery",
      "url": "https://decrypt.co/356461/bitcoin-traders-see-nearly-even-odds-69k-drop-100k-recovery",
      "source": "decrypt",
      "description": "Bitcoin sentiment on Myriad flipped bearish for first time in two months as traders bet on further downside amid shutdown fears and extreme market volatility.",
      "published": "2026-01-30T15:55:08+00:00"
    },
    {
      "title": "Morning Minute: Washington Just Gave Crypto the Green Light",
      "url": "https://decrypt.co/356463/morning-minute-washington-just-gave-crypto-the-green-light",
      "source": "decrypt",
      "description": "It was a big day for crypto policy in the US yesterday, but work still remains to be done",
      "published": "2026-01-30T14:41:10+00:00"
    },
    {
      "title": "Binance to Move $1 Billion User Protection Fund Into Bitcoin ",
      "url": "https://bitcoinmagazine.com/news/binance-to-move-1-billion-fund-to-bitcoin",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Binance to Move $1 Billion User Protection Fund Into Bitcoin As the bitcoin price slumps, Binance said it will convert the $1 billion stablecoin-backed Secure Asset Fund for Users entirely into bitcoin over the next 30 days. This post Binance to Move $1 Billion User Protection Fund Into Bitcoin first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T14:27:35+00:00"
    },
    {
      "title": "Trump Names Bitcoin-Friendly Kevin Warsh as Pick for Federal Reserve Chair",
      "url": "https://bitcoinmagazine.com/news/trump-names-kevin-warsh-as-pick-for-fed",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Trump Names Bitcoin-Friendly Kevin Warsh as Pick for Federal Reserve Chair President Donald Trump announced pro-bitcoin Kevin Warsh as his nominee to serve as chairman of the Federal Reserve, confirming speculation from prediction markets. This post Trump Names Bitcoin-Friendly Kevin Warsh as Pick for Federal Reserve Chair first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-30T13:06:38+00:00"
    },
    {
      "title": "Strategy Stock ($MSTR) Hits 52-Week Low As Bitcoin Craters Below $84,000",
      "url": "https://bitcoinmagazine.com/markets/strategy-stock-mstr-hits-52-week-low",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Strategy Stock ($MSTR) Hits 52-Week Low As Bitcoin Craters Below $84,000 Shares of Strategy ($MSTR) dropped as low as 12% today, currently trading at $140.88 and hitting a session low of $140.25. This post Strategy Stock ($MSTR) Hits 52-Week Low As Bitcoin Craters Below $84,000 first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-29T18:36:46+00:00"
    },
    {
      "title": "SEC Chair Paul Atkins to Make History as First Sitting Chair to Speak at The Bitcoin Conference in Las Vegas",
      "url": "https://bitcoinmagazine.com/news/paul-atkins-to-speak-at-bitcoin-conference",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine SEC Chair Paul Atkins to Make History as First Sitting Chair to Speak at The Bitcoin Conference in Las Vegas SEC Chairman Paul Atkins is going to speak at the Bitcoin 2026 Conference. This post SEC Chair Paul Atkins to Make History as First Sitting Chair to Speak at The Bitcoin Conference in Las Vegas first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-29T18:29:17+00:00"
    },
    {
      "title": "Crypto Market Structure Bill Advances Through Senate Agriculture Committee, No Democrats Vote In Favor",
      "url": "https://bitcoinmagazine.com/news/crypto-bill-advances-senate-committee",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Crypto Market Structure Bill Advances Through Senate Agriculture Committee, No Democrats Vote In Favor The Senate Agriculture Committee advanced a crypto market bill 12-11 along party lines. This post Crypto Market Structure Bill Advances Through Senate Agriculture Committee, No Democrats Vote In Favor first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-01-29T17:19:44+00:00"
    }
  ]
}