{
  "timestamp": "2026-02-06T05:00:02.881837+00:00",
  "sources": [
    "cointelegraph",
    "bitcoinmagazine",
    "decrypt"
  ],
  "failed_sources": [
    "coindesk"
  ],
  "article_count": 30,
  "results": [
    {
      "title": "Senator Lummis Urges Banks to 'Embrace' Stablecoins Amid CLARITY Act Stalemate",
      "url": "https://decrypt.co/357157/senator-lummis-banks-embrace-stablecoins-clarity-act-stalemate",
      "source": "decrypt",
      "description": "The Wyoming Senator said stablecoins give banks an \"entirely new financial product\" as the crypto market structure bill faces a delay.",
      "published": "2026-02-06T04:52:09+00:00"
    },
    {
      "title": "Bitcoin miners IREN, CleanSpark shares plunge as earnings fall short",
      "url": "https://cointelegraph.com/news/bitcoin-miners-iren-cleanspark-financial-earnings-short?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Crypto mining stocks have declined across the board the value of the entire crypto market fell almost 9% on Thursday.",
      "published": "2026-02-06T04:45:26+00:00"
    },
    {
      "title": "Kalshi boosts surveillance ahead of Super Bowl with independent committee",
      "url": "https://cointelegraph.com/news/kalshi-boosts-predictions-markets-surveillance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Kalshi has seen nearly $170 million in Super Bowl-related bets, and its move to boost oversight comes amid scrutiny of prediction markets by regulators and Congress.",
      "published": "2026-02-06T03:47:58+00:00"
    },
    {
      "title": "Bitcoin Miners IREN and CleanSpark Slide After Earnings Misses Deepen Sector Pressure",
      "url": "https://decrypt.co/357154/bitcoin-miners-iren-cleanspark-slide-earnings-misses-expectations",
      "source": "decrypt",
      "description": "Shares fell after both companies reported quarterly revenue below Wall Street expectations as Bitcoin dropped sharply.",
      "published": "2026-02-06T03:09:09+00:00"
    },
    {
      "title": "Crypto sentiment at lowest point since 2022 crash as Bitcoin tanks to $60K",
      "url": "https://cointelegraph.com/news/crypto-sentiment-at-lowest-point-since-luna-crash-as-btc-tanks-to-60k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin plummeted to a low of around $60,000 after the Crypto Fear & Greed Index hit its lowest score since mid-2022, when the Terra blockchain collapsed.",
      "published": "2026-02-06T03:01:59+00:00"
    },
    {
      "title": "Does Bitcoin's Retreat Signal a New Bear Market for Crypto?",
      "url": "https://decrypt.co/357151/bitcoins-retreat-signal-new-bear-market-crypto",
      "source": "decrypt",
      "description": "A single-day 14% drop and a drawdown of more than 50% have pushed Bitcoin into territory typically associated with bear markets.",
      "published": "2026-02-06T02:28:24+00:00"
    },
    {
      "title": "BlackRock’s IBIT hits daily volume record of $10B amid Bitcoin crash",
      "url": "https://cointelegraph.com/news/blackrock-ibit-daily-volume-record-10-billion-bitcoin-crash?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Traders were active in BlackRock’s iShares Bitcoin Trust ETF on Thursday as Bitcoin plummeted, falling 12% in the last 24 hours.",
      "published": "2026-02-06T01:52:34+00:00"
    },
    {
      "title": "OpenAI and Anthropic Roll Out Rival AI Models as Competition for Enterprise Heats Up",
      "url": "https://decrypt.co/357142/openai-anthropic-rival-ai-models-competition-enterprise-heats-up",
      "source": "decrypt",
      "description": "OpenAI and Anthropic released new flagship AI models within hours of each other on Thursday, with benchmark results suggesting they're optimized for different strengths.",
      "published": "2026-02-06T00:29:18+00:00"
    },
    {
      "title": "Strategy records $12.4B loss in Q4, shares dip 17% as Bitcoin tumbles",
      "url": "https://cointelegraph.com/news/strategy-reports-12b-loss-q4-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Strategy executives Phong Le and Andrew Kang say the company is on a strong financial footing despite it now being down 17.5% on its Bitcoin holdings.",
      "published": "2026-02-05T23:36:13+00:00"
    },
    {
      "title": "Waymo’s ‘Self-Driving’ Claims Called into Question on Capitol Hill",
      "url": "https://decrypt.co/357128/waymos-self-driving-claims-reality-check-capitol-hill",
      "source": "decrypt",
      "description": "Senators pressed Waymo over its use of human operators in the Philippines, questioning whether autonomy still means what Waymo says it does.",
      "published": "2026-02-05T23:04:43+00:00"
    },
    {
      "title": "Crypto Treasuries Fall Deeply Underwater as Bitcoin, Ethereum and Solana Dive",
      "url": "https://decrypt.co/357130/crypto-treasury-underwater-bitcoin-ethereum-solana-dive",
      "source": "decrypt",
      "description": "Prominent publicly traded crypto treasury firms are underwater on their holdings as Bitcoin and Ethereum keep falling.",
      "published": "2026-02-05T22:41:35+00:00"
    },
    {
      "title": "Will Bitcoin rebound to $90K by March? Here’s what BTC options say",
      "url": "https://cointelegraph.com/news/will-bitcoin-rebound-to-dollar90k-by-march-here-s-what-btc-options-say?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin fell below 63,000 as investors reacted to dismal US economic data, a weakening stock market and fears of an AI industry bubble. Does data forecast a return to $90,000 by March?",
      "published": "2026-02-05T22:17:26+00:00"
    },
    {
      "title": "Bitcoin Giant Strategy Records $12.4 Billion Q4 Loss as MSTR Shares Hit 18-Month Low",
      "url": "https://decrypt.co/357129/bitcoin-giant-strategy-12-4-billion-q4-loss-shares-18-month-low",
      "source": "decrypt",
      "description": "Michael Saylor called his firm a “digital fortress,\" but leading Bitcoin treasury Strategy has taken some serious hits in recent months.",
      "published": "2026-02-05T22:00:10+00:00"
    },
    {
      "title": "Bitcoin Price Plunges Toward $60,000 as $1 Billion in Liquidations Hit in 24 Hours",
      "url": "https://bitcoinmagazine.com/news/bitcoin-price-plunges-toward-60000",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Price Plunges Toward $60,000 as $1 Billion in Liquidations Hit in 24 Hours Bitcoin price has fallen roughly 50% from its all-time highs, with over $1 billion in liquidations recorded in the past 24 hours. This post Bitcoin Price Plunges Toward $60,000 as $1 Billion in Liquidations Hit in 24 Hours first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T21:42:10+00:00"
    },
    {
      "title": "EU tokenization companies push for DLT pilot changes amid US momentum",
      "url": "https://cointelegraph.com/news/eu-tokenization-dlt-pilot-rules-risk-pushing-onchain-markets-us?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "European tokenization companies urged EU lawmakers to quickly amend the DLT Pilot Regime, warning that current limits risk pushing onchain markets to the US.",
      "published": "2026-02-05T21:42:07+00:00"
    },
    {
      "title": "Bitcoin Miners Could Face Crisis After BTC Price Falls 50% From Peak",
      "url": "https://decrypt.co/357071/bitcoin-miners-face-crisis-btc-price-falls-50-percent",
      "source": "decrypt",
      "description": "The price of Bitcoin crashed below $63,000 on Thursday, not far above the average production cost of publicly traded miners.",
      "published": "2026-02-05T21:10:09+00:00"
    },
    {
      "title": "Paystand: The Payments Giants Quietly Supporting Bitcoin Circular Economies",
      "url": "https://bitcoinmagazine.com/business/paystand-the-payments-giants-quietly-supporting-bitcoin-circular-economies",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Paystand: The Payments Giants Quietly Supporting Bitcoin Circular Economies Paystand CEO Jeremy Almond revealed massive Bitcoin mining operation, teases B2B layer two protocol and his strategy to orange pill corporate America. This post Paystand: The Payments Giants Quietly Supporting Bitcoin Circular Economies first appeared on Bitcoin Magazine and is written by Juan Galt.",
      "published": "2026-02-05T20:49:24+00:00"
    },
    {
      "title": "Gemini announces exit from UK, EU, Australia, slashes workforce",
      "url": "https://cointelegraph.com/news/gemini-exit-uk-eu-australia-slashes-workforce?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Gemini, a US-based cryptocurrency exchange founded in 2015, will focus on growth in the United States due to its deep capital markets.",
      "published": "2026-02-05T20:28:07+00:00"
    },
    {
      "title": "Bitcoin slips under $64K as record-high selling intensifies: Where is the bottom?",
      "url": "https://cointelegraph.com/news/bitcoin-slips-under-dollar64k-as-record-high-selling-intensifies-where-is-the-price-bottom?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "Bitcoin touched new lows under $64,000 as market selling reached a historic level, and analysts warn that the bottom is not in. Does data support analysts’ sub-$60,000 prediction?",
      "published": "2026-02-05T20:21:14+00:00"
    },
    {
      "title": "Myriad Moves: How Low Will Bitcoin and Ethereum Go?",
      "url": "https://decrypt.co/357123/myriad-moves-how-low-bitcoin-ethereum-go",
      "source": "decrypt",
      "description": "Top markets on Myriad this week include predictions on Bitcoin and Ethereum’s next respective stops, plus the outcome of Super Bowl LX.",
      "published": "2026-02-05T20:15:27+00:00"
    },
    {
      "title": "Tether backs Anchorage Digital in $100M equity investment",
      "url": "https://cointelegraph.com/news/tether-backs-anchorage-digital-100m-equity-investment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "source": "cointelegraph",
      "description": "The investment extends an existing partnership with Anchorage and comes as the federally regulated crypto bank explores a major capital raise ahead of a potential IPO.",
      "published": "2026-02-05T20:07:18+00:00"
    },
    {
      "title": "Strategy ($MSTR) Falls 15% as Investors Brace for Earnings Call",
      "url": "https://bitcoinmagazine.com/news/strategy-falls-brace-for-earnings",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Strategy ($MSTR) Falls 15% as Investors Brace for Earnings Call Shares of Strategy ($MSTR) dropped sharply today, tumbling more than 15 % in heavy trading as Bitcoin continued to sell-off. This post Strategy ($MSTR) Falls 15% as Investors Brace for Earnings Call first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T19:34:04+00:00"
    },
    {
      "title": "JPMorgan: Bitcoin is Now a More Attractive Investment Than Gold Long Term",
      "url": "https://bitcoinmagazine.com/news/bitcoin-is-now-more-attractive-than-gold",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine JPMorgan: Bitcoin is Now a More Attractive Investment Than Gold Long Term JPMorgan says Bitcoin’s long-term case versus gold is strengthening despite its historic sell-off. This post JPMorgan: Bitcoin is Now a More Attractive Investment Than Gold Long Term first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T19:23:16+00:00"
    },
    {
      "title": "The v2 Transport: Bitcoin P2P Traffic Goes Dark",
      "url": "https://bitcoinmagazine.com/print/the-v2-transport-bitcoin-p2p-traffic-goes-dark",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine The v2 Transport: Bitcoin P2P Traffic Goes Dark From The Core Issue: Learn about the v2 transport protocol upgrade from 2024 that aims to keep your nodes internet traffic private from snooping. This post The v2 Transport: Bitcoin P2P Traffic Goes Dark first appeared on Bitcoin Magazine and is written by Pieter Wuille.",
      "published": "2026-02-05T19:16:34+00:00"
    },
    {
      "title": "Tom Lee's BitMine Hits 7-Month Stock Low as Ethereum Paper Losses Reach $8 Billion",
      "url": "https://decrypt.co/357114/tom-lee-bitmine-7-month-stock-low-ethereum-paper-losses-8-billion",
      "source": "decrypt",
      "description": "Shares in publicly traded Ethereum treasury firm BitMine Immersion Technologies have fallen to a seven-month low as unrealized losses mount.",
      "published": "2026-02-05T19:08:19+00:00"
    },
    {
      "title": "Senator Lummis to Work With Treasury on Bitcoin Tax Guidance, Hints At Potential Exemption ",
      "url": "https://bitcoinmagazine.com/news/senator-lummis-bitcoin-tax-guidance",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Senator Lummis to Work With Treasury on Bitcoin Tax Guidance, Hints At Potential Exemption In hearings today, Senator Lummis signaled willingness to work with Treasury on clearer Bitcoin tax guidance, including a potential de minimis exemption. This post Senator Lummis to Work With Treasury on Bitcoin Tax Guidance, Hints At Potential Exemption first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T17:15:02+00:00"
    },
    {
      "title": "Summer of Bitcoin 2026 Opens Applications for University Students Worldwide",
      "url": "https://bitcoinmagazine.com/news/summer-of-bitcoin-2026-opens-applications",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Summer of Bitcoin 2026 Opens Applications for University Students Worldwide Summer of Bitcoin has opened applications for its 2026 cohort. This post Summer of Bitcoin 2026 Opens Applications for University Students Worldwide first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T17:05:15+00:00"
    },
    {
      "title": "Bitcoin Falls Over $59,000 in Largest Drawdown Ever, Down Nearly 47% From All-Time High",
      "url": "https://bitcoinmagazine.com/markets/bitcoin-falls-over-59000-in-large-dip",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Falls Over $59,000 in Largest Drawdown Ever, Down Nearly 47% From All-Time High Bitcoin’s price crashed sharply on Thursday, sliding through critical support and dipping near $66,000 in volatile trading. This post Bitcoin Falls Over $59,000 in Largest Drawdown Ever, Down Nearly 47% From All-Time High first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T16:33:37+00:00"
    },
    {
      "title": "Virginia Advances Bill in Committee to Establish State Bitcoin Fund",
      "url": "https://bitcoinmagazine.com/news/virginia-advances-bill-for-bitcoin-fund",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Virginia Advances Bill in Committee to Establish State Bitcoin Fund Virginia lawmakers pushed forward a proposal that would allow state funds to be invested in bitcoin. This post Virginia Advances Bill in Committee to Establish State Bitcoin Fund first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T14:43:20+00:00"
    },
    {
      "title": "Bitcoin Price Crashes 9% to $69,000 As Markets Spiral Into Full Risk-Off Mode",
      "url": "https://bitcoinmagazine.com/markets/bitcoin-price-crashes-to-69000",
      "source": "bitcoinmagazine",
      "description": "Bitcoin Magazine Bitcoin Price Crashes 9% to $69,000 As Markets Spiral Into Full Risk-Off Mode The bitcoin price crashed to $69,000 in trading Thursday as a deepening selloff in global markets spilled into crypto markets. This post Bitcoin Price Crashes 9% to $69,000 As Markets Spiral Into Full Risk-Off Mode first appeared on Bitcoin Magazine and is written by Micah Zimmerman.",
      "published": "2026-02-05T13:04:54+00:00"
    }
  ]
}